// --------------  id: World_TriggerAction  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_TRIGGER_ACTION_H  // --------------------------  /* auto */
#define MY_TRIGGER_ACTION_H  // --------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MyTriggerAction;  // ----------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyTriggerAction {  // -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ int32_t data1;  // -------------------------------  /* auto */
/*  4*/ int32_t data2;  // -------------------------------  /* auto */
/*  8*/ __int16 id;  // ----------------------------------  /* auto */
/*  A*/ __int16 next;  // --------------------------------  /* auto */
/*  C*/ __int16 child;  // -------------------------------  /* auto */
/*  E*/ uint8_t type;  // --------------------------------  /* auto */
/*  F*/ uint8_t ff_gap[1];  // ---------------------------  /* auto */
/* 10*/ int32_t flags;  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*00508910*/ void dump();  // ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyTriggerAction) == 0x14);  // ------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_TRIGGER_ACTION_H  ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
