// -------------  id: constructor_005085F0  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_TRIGGER_WHEN_H  // ----------------------------  /* auto */
#define MY_TRIGGER_WHEN_H  // ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MyTriggerWhen;  // ------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyTriggerWhen {  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ int32_t data1;  // -------------------------------  /* auto */
/*  4*/ int32_t data2;  // -------------------------------  /* auto */
/*  8*/ __int16 id;  // ----------------------------------  /* auto */
/*  A*/ __int16 next;  // --------------------------------  /* auto */
/*  C*/ __int16 child;  // -------------------------------  /* auto */
/*  E*/ uint8_t type;  // --------------------------------  /* auto */
/*  F*/ uint8_t repeatCount;  // -------------------------  /* auto */
/* 10*/ int32_t flags;  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*005085F0*/ void constructor();  // ---------------------  /* auto */
/*00508600*/ uint8_t fun_508600(uint32_t *);  // ---------  /* auto */
/*00508640*/ char fun_508640();  // ----------------------  /* auto */
/*00508740*/ void dump();  // ----------------------------  /* auto */
/*00508810*/ int32_t fun_508810(uint32_t *);  // ---------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyTriggerWhen) == 0x14);  // --------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_TRIGGER_WHEN_H  ------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
