// -------------  id: constructor_00491DC0  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_CREATURE_DATA_OBJ_H  // -----------------------  /* auto */
#define MY_CREATURE_DATA_OBJ_H  // -----------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/CWorldEntry.h>  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct CWorld;  // -------------------------------------  /* auto */
  struct MyCreatureDataObj;  // --------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyCreatureDataObj {  // ---------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ CWorldEntry cwea1[37];  // -----------------------  /* auto */
/*3E7*/ CWorldEntry cwe1;  // ----------------------------  /* auto */
/*402*/ CWorldEntry cwe2;  // ----------------------------  /* auto */
/*41D*/ CWorldEntry cwe3;  // ----------------------------  /* auto */
/*438*/ CWorldEntry cwe4;  // ----------------------------  /* auto */
/*453*/ CWorldEntry cwe5;  // ----------------------------  /* auto */
/*46E*/ CWorldEntry cwea2[6];  // ------------------------  /* auto */
/*510*/ CWorldEntry cwe6;  // ----------------------------  /* auto */
/*52B*/ CWorldEntry cwe7;  // ----------------------------  /* auto */
/*546*/ CWorldEntry cwe8;  // ----------------------------  /* auto */
/*561*/ CWorldEntry cwe9;  // ----------------------------  /* auto */
/*57C*/ CWorldEntry cwe10;  // ---------------------------  /* auto */
/*597*/ char a1[24];  // ---------------------------------  /* auto */
/*5AF*/ int32_t f5AF;  // --------------------------------  /* auto */
/*5B3*/ char f5B3;  // -----------------------------------  /* auto */
/*5B4*/ int32_t f5B4;  // --------------------------------  /* auto */
/*5B8*/ int32_t f5B8;  // --------------------------------  /* auto */
/*5BC*/ int32_t f5BC;  // --------------------------------  /* auto */
/*5C0*/ int32_t f5C0;  // --------------------------------  /* auto */
/*5C4*/ __int16 f5C4;  // --------------------------------  /* auto */
/*5C6*/ int32_t f5C6;  // --------------------------------  /* auto */
/*5CA*/ int32_t f5CA;  // --------------------------------  /* auto */
/*5CE*/ int32_t f5CE;  // --------------------------------  /* auto */
/*5D2*/ int32_t f5D2;  // --------------------------------  /* auto */
/*5D6*/ int32_t f5D6;  // --------------------------------  /* auto */
/*5DA*/ uint8_t mcd1[6];  // -----------------------------  /* auto */
/*5E0*/ char f5E0;  // -----------------------------------  /* auto */
/*5E1*/ uint8_t mcd2[57];  // ----------------------------  /* auto */
/*61A*/ __int16 f61A;  // --------------------------------  /* auto */
/*61C*/ uint8_t mcd3[8];  // -----------------------------  /* auto */
/*624*/ __int16 f624;  // --------------------------------  /* auto */
/*626*/ uint16_t f626;  // -------------------------------  /* auto */
/*628*/ uint8_t mcd4_1[18];  // --------------------------  /* auto */
/*63A*/ __int16 f63A;  // --------------------------------  /* auto */
/*63C*/ uint8_t mcd4_2[12];  // --------------------------  /* auto */
/*648*/ __int16 f648;  // --------------------------------  /* auto */
/*64A*/ uint8_t mcd4_3[18];  // --------------------------  /* auto */
/*65C*/ __int16 f65C;  // --------------------------------  /* auto */
/*65E*/ uint8_t mcd5[15];  // ----------------------------  /* auto */
/*66D*/ char f66D;  // -----------------------------------  /* auto */
/*66E*/ uint8_t gap_66E[4];  // --------------------------  /* auto */
/*672*/ char f672;  // -----------------------------------  /* auto */
/*673*/ uint8_t f673[2];  // -----------------------------  /* auto */
/*675*/ int32_t f675;  // --------------------------------  /* auto */
/*679*/ uint8_t gap_679[4];  // --------------------------  /* auto */
/*67D*/ char f67D;  // -----------------------------------  /* auto */
/*67E*/ char f67E;  // -----------------------------------  /* auto */
/*67F*/ uint8_t f67F[3];  // -----------------------------  /* auto */
/*682*/ uint8_t f682[2];  // -----------------------------  /* auto */
/*684*/ char f684;  // -----------------------------------  /* auto */
/*685*/ char f685;  // -----------------------------------  /* auto */
/*686*/ int32_t flags;  // -------------------------------  /* auto */
/*68A*/ int32_t f68A;  // --------------------------------  /* auto */
/*68E*/ __int16 f68E;  // --------------------------------  /* auto */
/*690*/ __int16 airFriction;  // -------------------------  /* auto */
/*692*/ uint16_t health;  // -----------------------------  /* auto */
/*694*/ __int16 f694;  // --------------------------------  /* auto */
/*696*/ __int16 f696;  // --------------------------------  /* auto */
/*698*/ __int16 f698;  // --------------------------------  /* auto */
/*69A*/ __int16 f69A;  // --------------------------------  /* auto */
/*69C*/ uint16_t f69C;  // -------------------------------  /* auto */
/*69E*/ __int16 f69E;  // --------------------------------  /* auto */
/*6A0*/ __int16 f6A0;  // --------------------------------  /* auto */
/*6A2*/ __int16 f6A2;  // --------------------------------  /* auto */
/*6A4*/ __int16 f6A4;  // --------------------------------  /* auto */
/*6A6*/ __int16 f6A6;  // --------------------------------  /* auto */
/*6A8*/ __int16 f6A8;  // --------------------------------  /* auto */
/*6AA*/ __int16 f6AA;  // --------------------------------  /* auto */
/*6AC*/ __int16 f6AC;  // --------------------------------  /* auto */
/*6AE*/ __int16 f6AE;  // --------------------------------  /* auto */
/*6B0*/ __int16 f6B0;  // --------------------------------  /* auto */
/*6B2*/ __int16 f6B2;  // --------------------------------  /* auto */
/*6B4*/ char f6B4;  // -----------------------------------  /* auto */
/*6B5*/ __int16 f6B5;  // --------------------------------  /* auto */
/*6B7*/ __int16 f6B7;  // --------------------------------  /* auto */
/*6B9*/ __int16 f6B9;  // --------------------------------  /* auto */
/*6BB*/ __int16 f6BB;  // --------------------------------  /* auto */
/*6BD*/ __int16 f6BD;  // --------------------------------  /* auto */
/*6BF*/ __int16 f6BF;  // --------------------------------  /* auto */
/*6C1*/ __int16 f6C1;  // --------------------------------  /* auto */
/*6C3*/ __int16 f6C3;  // --------------------------------  /* auto */
/*6C5*/ __int16 f6C5;  // --------------------------------  /* auto */
/*6C7*/ __int16 f6C7;  // --------------------------------  /* auto */
/*6C9*/ __int16 f6C9;  // --------------------------------  /* auto */
/*6CB*/ __int16 f6CB;  // --------------------------------  /* auto */
/*6CD*/ uint16_t f6CD[10];  // ---------------------------  /* auto */
/*6E1*/ __int16 f6E1;  // --------------------------------  /* auto */
/*6E3*/ int32_t f6E3;  // --------------------------------  /* auto */
/*6E7*/ int32_t f6E7;  // --------------------------------  /* auto */
/*6EB*/ char f6EB;  // -----------------------------------  /* auto */
/*6EC*/ uint32_t oi3x8;  // ------------------------------  /* auto */
/*6F0*/ int32_t f6F0;  // --------------------------------  /* auto */
/*6F4*/ int32_t f6F4;  // --------------------------------  /* auto */
/*6F8*/ uint8_t f6f8_gap[84];  // ------------------------  /* auto */
/*74C*/ int32_t f74C;  // --------------------------------  /* auto */
/*750*/ int32_t f750;  // --------------------------------  /* auto */
/*754*/ int32_t f754;  // --------------------------------  /* auto */
/*758*/ int32_t f758;  // --------------------------------  /* auto */
/*75C*/ int32_t f75C;  // --------------------------------  /* auto */
/*760*/ int32_t f760;  // --------------------------------  /* auto */
/*764*/ __int16 f764;  // --------------------------------  /* auto */
/*766*/ int32_t f766;  // --------------------------------  /* auto */
/*76A*/ __int16 unhappyAt;  // ---------------------------  /* auto */
/*76C*/ int32_t f76C;  // --------------------------------  /* auto */
/*770*/ char someId__;  // -------------------------------  /* auto */
/*771*/ char f771;  // -----------------------------------  /* auto */
/*772*/ __int16 f772;  // --------------------------------  /* auto */
/*774*/ __int16 f774;  // --------------------------------  /* auto */
/*776*/ __int16 f776;  // --------------------------------  /* auto */
/*778*/ __int16 f778;  // --------------------------------  /* auto */
/*77A*/ char f77A;  // -----------------------------------  /* auto */
/*77B*/ int32_t f77B;  // --------------------------------  /* auto */
/*77F*/ int32_t f77F;  // --------------------------------  /* auto */
/*783*/ int32_t f783;  // --------------------------------  /* auto */
/*787*/ char f787;  // -----------------------------------  /* auto */
/*788*/ char f788;  // -----------------------------------  /* auto */
/*789*/ char f789;  // -----------------------------------  /* auto */
/*78A*/ char f78A;  // -----------------------------------  /* auto */
/*78B*/ uint8_t f78B;  // --------------------------------  /* auto */
/*78C*/ uint8_t f78C;  // --------------------------------  /* auto */
/*78D*/ uint8_t f78D;  // --------------------------------  /* auto */
/*78E*/ uint8_t f78E;  // --------------------------------  /* auto */
/*78F*/ uint8_t f78F;  // --------------------------------  /* auto */
/*790*/ char f790;  // -----------------------------------  /* auto */
/*791*/ __int16 f791;  // --------------------------------  /* auto */
/*793*/ int32_t f793;  // --------------------------------  /* auto */
/*797*/ int32_t f797;  // --------------------------------  /* auto */
/*79B*/ int32_t f79B;  // --------------------------------  /* auto */
/*79F*/ __int16 f79F;  // --------------------------------  /* auto */
/*7A1*/ __int16 f7A1;  // --------------------------------  /* auto */
/*7A3*/ uint16_t f7A3[96];  // ---------------------------  /* auto */
/*863*/ int32_t f863;  // --------------------------------  /* auto */
/*867*/ int32_t f867;  // --------------------------------  /* auto */
/*86B*/ int32_t f86B;  // --------------------------------  /* auto */
/*86F*/ __int16 f86F;  // --------------------------------  /* auto */
/*871*/ CWorldEntry cwe11;  // ---------------------------  /* auto */
/*88C*/ uint8_t gap_88C[8];  // --------------------------  /* auto */
/*894*/ char f894;  // -----------------------------------  /* auto */
/*895*/ __int16 f895;  // --------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*00491DC0*/ void constructor();  // ---------------------  /* auto */
/*00492230*/ void destructor();  // ----------------------  /* auto */
/*00492320*/ int32_t fun_492320(int32_t, CWorld *, int32_t *);  /* auto */
/*00494360*/ char fun_494360();  // ----------------------  /* auto */
/*00494860*/ int32_t fun_494860(int32_t);  // ------------  /* auto */
/*00494880*/ int32_t fun_494880(int32_t);  // ------------  /* auto */
/*0051F3B0*/ MyCreatureDataObj *fun_51F3B0(int32_t);  // -  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyCreatureDataObj) == 0x897);  // ---  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_CREATURE_DATA_OBJ_H  -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
