// -------------  id: constructor_004F7810  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_CREATURE_SPELL_DATA_OBJ_H  // -----------------  /* auto */
#define MY_CREATURE_SPELL_DATA_OBJ_H  // -----------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/CWorldEntry.h>  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MyCreatureSpellDataObj;  // ---------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyCreatureSpellDataObj {  // ----------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ CWorldEntry f0;  // ------------------------------  /* auto */
/* 1B*/ uint8_t f1b_gap[4];  // --------------------------  /* auto */
/* 1F*/ int32_t f1F;  // ---------------------------------  /* auto */
/* 23*/ int32_t f23;  // ---------------------------------  /* auto */
/* 27*/ int32_t f27;  // ---------------------------------  /* auto */
/* 2B*/ __int16 f2B;  // ---------------------------------  /* auto */
/* 2D*/ int32_t f2D;  // ---------------------------------  /* auto */
/* 31*/ int32_t f31;  // ---------------------------------  /* auto */
/* 35*/ __int16 f35;  // ---------------------------------  /* auto */
/* 37*/ __int16 f37;  // ---------------------------------  /* auto */
/* 39*/ __int16 f39;  // ---------------------------------  /* auto */
/* 3B*/ __int16 f3B;  // ---------------------------------  /* auto */
/* 3D*/ __int16 f3D;  // ---------------------------------  /* auto */
/* 3F*/ int32_t f3F;  // ---------------------------------  /* auto */
/* 43*/ char f43;  // ------------------------------------  /* auto */
/* 44*/ char f44;  // ------------------------------------  /* auto */
/* 45*/ char f45;  // ------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*004F7810*/ void constructor();  // ---------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyCreatureSpellDataObj) == 0x46);      /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_CREATURE_SPELL_DATA_OBJ_H  -------------------  /* auto */
// -------------------------------------------------------  /* auto */
