// -------------  id: constructor_004A7040  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_DOOR_DATA_OBJ_H  // ---------------------------  /* auto */
#define MY_DOOR_DATA_OBJ_H  // ---------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/CWorldEntry.h>  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MyDoorDataObj;  // ------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyDoorDataObj {  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ CWorldEntry f0;  // ------------------------------  /* auto */
/* 1B*/ CWorldEntry f1B;  // -----------------------------  /* auto */
/* 36*/ CWorldEntry f36;  // -----------------------------  /* auto */
/* 51*/ CWorldEntry f51;  // -----------------------------  /* auto */
/* 6C*/ CWorldEntry f6C;  // -----------------------------  /* auto */
/* 87*/ uint8_t gap_87[4];  // ---------------------------  /* auto */
/* 8B*/ int32_t f8B;  // ---------------------------------  /* auto */
/* 8F*/ __int16 f8F;  // ---------------------------------  /* auto */
/* 91*/ __int16 f91;  // ---------------------------------  /* auto */
/* 93*/ __int16 f93;  // ---------------------------------  /* auto */
/* 95*/ __int16 f95;  // ---------------------------------  /* auto */
/* 97*/ __int16 f97;  // ---------------------------------  /* auto */
/* 99*/ __int16 f99;  // ---------------------------------  /* auto */
/* 9B*/ __int16 f9B;  // ---------------------------------  /* auto */
/* 9D*/ __int16 f9D;  // ---------------------------------  /* auto */
/* 9F*/ __int16 f9F;  // ---------------------------------  /* auto */
/* A1*/ __int16 fA1;  // ---------------------------------  /* auto */
/* A3*/ __int16 fA3;  // ---------------------------------  /* auto */
/* A5*/ __int16 fA5;  // ---------------------------------  /* auto */
/* A7*/ __int16 fA7;  // ---------------------------------  /* auto */
/* A9*/ int32_t fA9;  // ---------------------------------  /* auto */
/* AD*/ char fAD;  // ------------------------------------  /* auto */
/* AE*/ __int16 fAE;  // ---------------------------------  /* auto */
/* B0*/ char fB0;  // ------------------------------------  /* auto */
/* B1*/ char fB1;  // ------------------------------------  /* auto */
/* B2*/ char fB2;  // ------------------------------------  /* auto */
/* B3*/ char fB3;  // ------------------------------------  /* auto */
/* B4*/ char fB4;  // ------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*004A7040*/ void constructor();  // ---------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyDoorDataObj) == 0xB5);  // --------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_DOOR_DATA_OBJ_H  -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
