// -------------  id: constructor_004F7C70  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_KEEPER_SPELL_DATA_OBJ_H  // -------------------  /* auto */
#define MY_KEEPER_SPELL_DATA_OBJ_H  // -------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/CWorldEntry.h>  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MyKeeperSpellDataObj;  // -----------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyKeeperSpellDataObj {  // ------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ CWorldEntry f0;  // ------------------------------  /* auto */
/* 1B*/ CWorldEntry f1B;  // -----------------------------  /* auto */
/* 36*/ uint8_t gap_36[4];  // ---------------------------  /* auto */
/* 3A*/ int32_t f3A;  // ---------------------------------  /* auto */
/* 3E*/ int32_t f3E;  // ---------------------------------  /* auto */
/* 42*/ char f42;  // ------------------------------------  /* auto */
/* 43*/ int32_t f43;  // ---------------------------------  /* auto */
/* 47*/ int32_t f47;  // ---------------------------------  /* auto */
/* 4B*/ char f4B;  // ------------------------------------  /* auto */
/* 4C*/ int32_t f4C;  // ---------------------------------  /* auto */
/* 50*/ int32_t f50;  // ---------------------------------  /* auto */
/* 54*/ int32_t f54;  // ---------------------------------  /* auto */
/* 58*/ int32_t f58;  // ---------------------------------  /* auto */
/* 5C*/ int32_t f5C;  // ---------------------------------  /* auto */
/* 60*/ int32_t f60;  // ---------------------------------  /* auto */
/* 64*/ __int16 f64;  // ---------------------------------  /* auto */
/* 66*/ __int16 f66;  // ---------------------------------  /* auto */
/* 68*/ __int16 f68;  // ---------------------------------  /* auto */
/* 6A*/ __int16 f6A;  // ---------------------------------  /* auto */
/* 6C*/ char f6C;  // ------------------------------------  /* auto */
/* 6D*/ int32_t f6D;  // ---------------------------------  /* auto */
/* 71*/ int32_t f71;  // ---------------------------------  /* auto */
/* 75*/ char f75;  // ------------------------------------  /* auto */
/* 76*/ char f76;  // ------------------------------------  /* auto */
/* 77*/ char f77;  // ------------------------------------  /* auto */
/* 78*/ char f78;  // ------------------------------------  /* auto */
/* 79*/ char f79;  // ------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*004F7C70*/ void constructor();  // ---------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyKeeperSpellDataObj) == 0x7A);  // -  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_KEEPER_SPELL_DATA_OBJ_H  ---------------------  /* auto */
// -------------------------------------------------------  /* auto */
