// -------------  id: constructor_004EAB70  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_ROOM_DATA_OBJ_H  // ---------------------------  /* auto */
#define MY_ROOM_DATA_OBJ_H  // ---------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/CWorldEntry.h>  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MyRoomDataObj;  // ------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyRoomDataObj {  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ CWorldEntry f0;  // ------------------------------  /* auto */
/* 1B*/ CWorldEntry f1B;  // -----------------------------  /* auto */
/* 36*/ CWorldEntry f36;  // -----------------------------  /* auto */
/* 51*/ CWorldEntry f51;  // -----------------------------  /* auto */
/* 6C*/ CWorldEntry f6C;  // -----------------------------  /* auto */
/* 87*/ CWorldEntry f87;  // -----------------------------  /* auto */
/* A2*/ uint8_t fa2_gap[4];  // --------------------------  /* auto */
/* A6*/ CWorldEntry fA6;  // -----------------------------  /* auto */
/* C1*/ CWorldEntry fC1[16];  // -------------------------  /* auto */
/*271*/ CWorldEntry f271[16];  // ------------------------  /* auto */
/*421*/ int32_t f421;  // --------------------------------  /* auto */
/*425*/ int32_t f425;  // --------------------------------  /* auto */
/*429*/ int32_t f429;  // --------------------------------  /* auto */
/*42D*/ int32_t f42D;  // --------------------------------  /* auto */
/*431*/ int32_t f431;  // --------------------------------  /* auto */
/*435*/ int32_t f435;  // --------------------------------  /* auto */
/*439*/ int32_t f439;  // --------------------------------  /* auto */
/*43D*/ __int16 f43D;  // --------------------------------  /* auto */
/*43F*/ __int16 f43F;  // --------------------------------  /* auto */
/*441*/ __int16 f441;  // --------------------------------  /* auto */
/*443*/ __int16 f443;  // --------------------------------  /* auto */
/*445*/ __int16 f445;  // --------------------------------  /* auto */
/*447*/ __int16 f447;  // --------------------------------  /* auto */
/*449*/ int32_t f449;  // --------------------------------  /* auto */
/*44D*/ char f44D;  // -----------------------------------  /* auto */
/*44E*/ char f44E;  // -----------------------------------  /* auto */
/*44F*/ char f44F;  // -----------------------------------  /* auto */
/*450*/ __int16 f450;  // --------------------------------  /* auto */
/*452*/ char f452;  // -----------------------------------  /* auto */
/*453*/ char f453;  // -----------------------------------  /* auto */
/*454*/ char f454;  // -----------------------------------  /* auto */
/*455*/ char f455;  // -----------------------------------  /* auto */
/*456*/ __int16 f456;  // --------------------------------  /* auto */
/*458*/ __int16 f458;  // --------------------------------  /* auto */
/*45A*/ __int16 f45A;  // --------------------------------  /* auto */
/*45C*/ __int16 f45C;  // --------------------------------  /* auto */
/*45E*/ char f45E;  // -----------------------------------  /* auto */
/*45F*/ int32_t f45F;  // --------------------------------  /* auto */
/*463*/ char f463;  // -----------------------------------  /* auto */
/*464*/ char f464;  // -----------------------------------  /* auto */
/*465*/ char f465;  // -----------------------------------  /* auto */
/*466*/ char f466;  // -----------------------------------  /* auto */
/*467*/ CWorldEntry f467;  // ----------------------------  /* auto */
/*482*/ uint8_t gap_482[3];  // --------------------------  /* auto */
/*485*/ char f485;  // -----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*004EAB70*/ void constructor();  // ---------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyRoomDataObj) == 0x486);  // -------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_ROOM_DATA_OBJ_H  -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
