// -------------  id: constructor_004ACD60  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_SHOT_DATA_OBJ_H  // ---------------------------  /* auto */
#define MY_SHOT_DATA_OBJ_H  // ---------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/CWorldEntry.h>  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MyShotDataObj;  // ------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyShotDataObj {  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ CWorldEntry f0;  // ------------------------------  /* auto */
/* 1B*/ char f1B[24];  // --------------------------------  /* auto */
/* 33*/ uint8_t gap_33[4];  // ---------------------------  /* auto */
/* 37*/ int32_t f37;  // ---------------------------------  /* auto */
/* 3B*/ int32_t f3B;  // ---------------------------------  /* auto */
/* 3F*/ int32_t f3F;  // ---------------------------------  /* auto */
/* 43*/ int32_t f43;  // ---------------------------------  /* auto */
/* 47*/ __int16 f47;  // ---------------------------------  /* auto */
/* 49*/ __int16 f49;  // ---------------------------------  /* auto */
/* 4B*/ __int16 f4B;  // ---------------------------------  /* auto */
/* 4D*/ __int16 f4D;  // ---------------------------------  /* auto */
/* 4F*/ __int16 f4F;  // ---------------------------------  /* auto */
/* 51*/ char f51;  // ------------------------------------  /* auto */
/* 52*/ __int16 f52;  // ---------------------------------  /* auto */
/* 54*/ int32_t f54;  // ---------------------------------  /* auto */
/* 58*/ char f58;  // ------------------------------------  /* auto */
/* 59*/ __int16 f59;  // ---------------------------------  /* auto */
/* 5B*/ __int16 f5B;  // ---------------------------------  /* auto */
/* 5D*/ char f5D;  // ------------------------------------  /* auto */
/* 5E*/ __int16 f5E;  // ---------------------------------  /* auto */
/* 60*/ char f60;  // ------------------------------------  /* auto */
/* 61*/ __int16 f61;  // ---------------------------------  /* auto */
/* 63*/ char f63;  // ------------------------------------  /* auto */
/* 64*/ __int16 f64;  // ---------------------------------  /* auto */
/* 66*/ char f66;  // ------------------------------------  /* auto */
/* 67*/ __int16 f67;  // ---------------------------------  /* auto */
/* 69*/ char f69;  // ------------------------------------  /* auto */
/* 6A*/ char f6A;  // ------------------------------------  /* auto */
/* 6B*/ char f6B;  // ------------------------------------  /* auto */
/* 6C*/ char f6C;  // ------------------------------------  /* auto */
/* 6D*/ __int16 f6D;  // ---------------------------------  /* auto */
/* 6F*/ __int16 f6F;  // ---------------------------------  /* auto */
/* 71*/ char f71;  // ------------------------------------  /* auto */
/* 72*/ int32_t f72;  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*004ACD60*/ void constructor();  // ---------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyShotDataObj) == 0x76);  // --------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_SHOT_DATA_OBJ_H  -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
