// -------------  id: constructor_004F6570  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_TERRAIN_DATA_OBJ_H  // ------------------------  /* auto */
#define MY_TERRAIN_DATA_OBJ_H  // ------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/CWorldEntry.h>  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MyTerrainDataObj;  // ---------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyTerrainDataObj {  // ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ CWorldEntry f0;  // ------------------------------  /* auto */
/* 1B*/ CWorldEntry f1B;  // -----------------------------  /* auto */
/* 36*/ CWorldEntry f36;  // -----------------------------  /* auto */
/* 51*/ CWorldEntry f51;  // -----------------------------  /* auto */
/* 6C*/ char f6C[24];  // --------------------------------  /* auto */
/* 84*/ uint8_t gap_84[4];  // ---------------------------  /* auto */
/* 88*/ CWorldEntry f88[8];  // --------------------------  /* auto */
/*160*/ CWorldEntry f160;  // ----------------------------  /* auto */
/*17B*/ int32_t f17B;  // --------------------------------  /* auto */
/*17F*/ __int16 f17F;  // --------------------------------  /* auto */
/*181*/ __int16 f181;  // --------------------------------  /* auto */
/*183*/ __int16 f183;  // --------------------------------  /* auto */
/*185*/ __int16 f185;  // --------------------------------  /* auto */
/*187*/ __int16 f187;  // --------------------------------  /* auto */
/*189*/ __int16 f189;  // --------------------------------  /* auto */
/*18B*/ __int16 f18B;  // --------------------------------  /* auto */
/*18D*/ __int16 f18D;  // --------------------------------  /* auto */
/*18F*/ __int16 f18F;  // --------------------------------  /* auto */
/*191*/ __int16 f191;  // --------------------------------  /* auto */
/*193*/ __int16 f193;  // --------------------------------  /* auto */
/*195*/ int32_t f195;  // --------------------------------  /* auto */
/*199*/ int32_t f199;  // --------------------------------  /* auto */
/*19D*/ int32_t f19D;  // --------------------------------  /* auto */
/*1A1*/ char f1A1;  // -----------------------------------  /* auto */
/*1A2*/ uint8_t f1A2[3];  // -----------------------------  /* auto */
/*1A5*/ char f1A5;  // -----------------------------------  /* auto */
/*1A6*/ uint8_t f1A6[3];  // -----------------------------  /* auto */
/*1A9*/ __int16 f1A9;  // --------------------------------  /* auto */
/*1AB*/ __int16 f1AB;  // --------------------------------  /* auto */
/*1AD*/ __int16 f1AD;  // --------------------------------  /* auto */
/*1AF*/ __int16 f1AF;  // --------------------------------  /* auto */
/*1B1*/ __int16 f1B1;  // --------------------------------  /* auto */
/*1B3*/ __int16 f1B3;  // --------------------------------  /* auto */
/*1B5*/ int32_t f1B5;  // --------------------------------  /* auto */
/*1B9*/ __int16 f1B9;  // --------------------------------  /* auto */
/*1BB*/ __int16 f1BB;  // --------------------------------  /* auto */
/*1BD*/ __int16 f1BD;  // --------------------------------  /* auto */
/*1BF*/ int32_t f1BF;  // --------------------------------  /* auto */
/*1C3*/ char f1C3;  // -----------------------------------  /* auto */
/*1C4*/ char f1C4;  // -----------------------------------  /* auto */
/*1C5*/ char f1C5;  // -----------------------------------  /* auto */
/*1C6*/ char f1C6;  // -----------------------------------  /* auto */
/*1C7*/ __int16 f1C7;  // --------------------------------  /* auto */
/*1C9*/ __int16 f1C9;  // --------------------------------  /* auto */
/*1CB*/ uint8_t f1CB;  // --------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*004F6570*/ void constructor();  // ---------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyTerrainDataObj) == 0x1CC);  // ----  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_TERRAIN_DATA_OBJ_H  --------------------------  /* auto */
// -------------------------------------------------------  /* auto */
