// -------------  id: constructor_004AA330  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_TRAP_DATA_OBJ_H  // ---------------------------  /* auto */
#define MY_TRAP_DATA_OBJ_H  // ---------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/CWorldEntry.h>  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MyTrapDataObj;  // ------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyTrapDataObj {  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ CWorldEntry f0;  // ------------------------------  /* auto */
/* 1B*/ CWorldEntry f1B;  // -----------------------------  /* auto */
/* 36*/ CWorldEntry f36;  // -----------------------------  /* auto */
/* 51*/ CWorldEntry f51;  // -----------------------------  /* auto */
/* 6C*/ uint8_t f6c_gap[4];  // --------------------------  /* auto */
/* 70*/ int32_t f70;  // ---------------------------------  /* auto */
/* 74*/ int32_t f74;  // ---------------------------------  /* auto */
/* 78*/ int32_t f78;  // ---------------------------------  /* auto */
/* 7C*/ int32_t f7C;  // ---------------------------------  /* auto */
/* 80*/ int32_t f80;  // ---------------------------------  /* auto */
/* 84*/ int32_t f84;  // ---------------------------------  /* auto */
/* 88*/ int32_t f88;  // ---------------------------------  /* auto */
/* 8C*/ __int16 f8C;  // ---------------------------------  /* auto */
/* 8E*/ int32_t f8E;  // ---------------------------------  /* auto */
/* 92*/ __int16 f92;  // ---------------------------------  /* auto */
/* 94*/ __int16 f94;  // ---------------------------------  /* auto */
/* 96*/ __int16 f96;  // ---------------------------------  /* auto */
/* 98*/ __int16 f98;  // ---------------------------------  /* auto */
/* 9A*/ int32_t f9A;  // ---------------------------------  /* auto */
/* 9E*/ __int16 f9E;  // ---------------------------------  /* auto */
/* A0*/ __int16 fA0;  // ---------------------------------  /* auto */
/* A2*/ __int16 fA2;  // ---------------------------------  /* auto */
/* A4*/ __int16 fA4;  // ---------------------------------  /* auto */
/* A6*/ __int16 fA6;  // ---------------------------------  /* auto */
/* A8*/ __int16 fA8;  // ---------------------------------  /* auto */
/* AA*/ __int16 fAA;  // ---------------------------------  /* auto */
/* AC*/ __int16 fAC;  // ---------------------------------  /* auto */
/* AE*/ __int16 fAE;  // ---------------------------------  /* auto */
/* B0*/ int32_t fB0;  // ---------------------------------  /* auto */
/* B4*/ char fB4;  // ------------------------------------  /* auto */
/* B5*/ __int16 fB5;  // ---------------------------------  /* auto */
/* B7*/ __int16 fB7;  // ---------------------------------  /* auto */
/* B9*/ __int16 fB9;  // ---------------------------------  /* auto */
/* BB*/ char fBB;  // ------------------------------------  /* auto */
/* BC*/ char fBC;  // ------------------------------------  /* auto */
/* BD*/ char fBD;  // ------------------------------------  /* auto */
/* BE*/ char fBE;  // ------------------------------------  /* auto */
/* BF*/ char fBF;  // ------------------------------------  /* auto */
/* C0*/ char fC0;  // ------------------------------------  /* auto */
/* C1*/ int32_t fC1;  // ---------------------------------  /* auto */
/* C5*/ int32_t fC5;  // ---------------------------------  /* auto */
/* C9*/ int32_t fC9;  // ---------------------------------  /* auto */
/* CD*/ int32_t fCD;  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*004AA330*/ void constructor();  // ---------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyTrapDataObj) == 0xD1);  // --------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_TRAP_DATA_OBJ_H  -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
