// -------------  id: constructor_00452B30  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_MAP_ELEMENT_H  // -----------------------------  /* auto */
#define MY_MAP_ELEMENT_H  // -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MyMapElement;  // -------------------------------  /* auto */
  struct TbDiscFile;  // ---------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyMapElement {  // --------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ __int16 f0;  // ----------------------------------  /* auto */
/*  2*/ uint16_t f2;  // ---------------------------------  /* auto */
/*  4*/ uint8_t f4;  // ----------------------------------  /* auto */
/*  5*/ uint8_t f5;  // ----------------------------------  /* auto */
/*  6*/ uint16_t f6;  // ---------------------------------  /* auto */
/*  8*/ __int16 f8;  // ----------------------------------  /* auto */
/*  A*/ uint8_t fA;  // ----------------------------------  /* auto */
/*  B*/ uint8_t flags;  // -------------------------------  /* auto */
/*  C*/ uint8_t fC;  // ----------------------------------  /* auto */
/*  D*/ uint8_t fd_gap[2];  // ---------------------------  /* auto */
/*  F*/ char end;  // ------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*00452B30*/ void constructor();  // ---------------------  /* auto */
/*00452B90*/ BOOL saveToTbDiscFile(TbDiscFile **);  // ---  /* auto */
/*00452F60*/ uint16_t fun_452F60(int32_t *, int32_t);       /* auto */
/*004559D0*/ __int16 fun_4559D0(__int16);  // ------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyMapElement) == 0x10);  // ---------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_MAP_ELEMENT_H  -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
