// -------------  id: constructor_00449470  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef C_CAMERA_H  // -----------------------------------  /* auto */
#define C_CAMERA_H  // -----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/My_sub_56F850.h>  // -----------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct CCamera;  // ------------------------------------  /* auto */
  struct Vec3i;  // --------------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct CCamera {  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ int32_t f0;  // ----------------------------------  /* auto */
/*  4*/ float matrix[3][3];  // --------------------------  /* auto */
/* 28*/ My_sub_56F850 My_sub_56F850_arr_x22[22];  // -----  /* auto */
/*D38*/ int32_t fD38;  // --------------------------------  /* auto */
/*D3C*/ int32_t fD3C;  // --------------------------------  /* auto */
/*D40*/ int32_t fD40;  // --------------------------------  /* auto */
/*D44*/ int32_t fD44;  // --------------------------------  /* auto */
/*D48*/ int32_t fD48;  // --------------------------------  /* auto */
/*D4C*/ int32_t fD4C;  // --------------------------------  /* auto */
/*D50*/ int32_t minZoomLevel;  // ------------------------  /* auto */
/*D54*/ int32_t maxZoomLevel;  // ------------------------  /* auto */
/*D58*/ int32_t fD58;  // --------------------------------  /* auto */
/*D5C*/ int32_t fD5C;  // --------------------------------  /* auto */
/*D60*/ int32_t fD60;  // --------------------------------  /* auto */
/*D64*/ int32_t fD64;  // --------------------------------  /* auto */
/*D68*/ int32_t arrx3__worldCameraPos[3];  // ------------  /* auto */
/*D74*/ int32_t arrx3[3];  // ----------------------------  /* auto */
/*D80*/ int32_t curZoomLevel;  // ------------------------  /* auto */
/*D84*/ int16_t fD84;  // --------------------------------  /* auto */
/*D86*/ __int16 fD86;  // --------------------------------  /* auto */
/*D88*/ __int16 fD88;  // --------------------------------  /* auto */
/*D8A*/ int8_t fd8a_gap[4];  // --------------------------  /* auto */
/*D8E*/ int32_t fD8E;  // --------------------------------  /* auto */
/*D92*/ char fD92;  // -----------------------------------  /* auto */
/*D93*/ int8_t gapD93[3];  // ----------------------------  /* auto */
/*D96*/ int32_t arrx3_D96[3];  // ------------------------  /* auto */
/*DA2*/ int8_t gap_DA2[6];  // ---------------------------  /* auto */
/*DA8*/ int32_t _mode;  // -------------------------------  /* auto */
/*DAC*/ int32_t fDAC;  // --------------------------------  /* auto */
/*DB0*/ int32_t fDB0;  // --------------------------------  /* auto */
/*DB4*/ int16_t fDB4;  // --------------------------------  /* auto */
/*DB6*/ int32_t arrx3_DB6[3];  // ------------------------  /* auto */
/*DC2*/ int32_t fDC2;  // --------------------------------  /* auto */
/*DC6*/ __int16 fDC6;  // --------------------------------  /* auto */
/*DC8*/ __int16 fDC8;  // --------------------------------  /* auto */
/*DCA*/ int16_t fDCA;  // --------------------------------  /* auto */
/*DCC*/ int32_t fDCC;  // --------------------------------  /* auto */
/*DD0*/ int32_t fDD0;  // --------------------------------  /* auto */
/*DD4*/ int32_t _mode_cpyf;  // --------------------------  /* auto */
/*DD8*/ int32_t fDD8;  // --------------------------------  /* auto */
/*DDC*/ int8_t gap_DDC[4];  // ---------------------------  /* auto */
/*DE0*/ int32_t fDE0;  // --------------------------------  /* auto */
/*DE4*/ int32_t fDE4;  // --------------------------------  /* auto */
/*DE8*/ int32_t fDE8;  // --------------------------------  /* auto */
/*DEC*/ int16_t fDEC;  // --------------------------------  /* auto */
/*DEE*/ int32_t arrx3_DEE[3];  // ------------------------  /* auto */
/*DFA*/ int8_t gap_DFA[8];  // ---------------------------  /* auto */
/*E02*/ int16_t fE02;  // --------------------------------  /* auto */
/*E04*/ int32_t arrx3_E04[3];  // ------------------------  /* auto */
/*E10*/ int8_t gap_E10[44];  // --------------------------  /* auto */
/*E3C*/ int32_t flags;  // -------------------------------  /* auto */
/*E40*/ int8_t gap_E40[8];  // ---------------------------  /* auto */
/*E48*/ int16_t fE48;  // --------------------------------  /* auto */
/*E4A*/ int32_t timeMs;  // ------------------------------  /* auto */
/*E4E*/ int32_t fE4E;  // --------------------------------  /* auto */
/*E52*/ int32_t fE52;  // --------------------------------  /* auto */
/*E56*/ int32_t fE56;  // --------------------------------  /* auto */
/*E5A*/ int32_t fE5A;  // --------------------------------  /* auto */
/*E5E*/ int32_t fE5E;  // --------------------------------  /* auto */
/*E62*/ int32_t left;  // --------------------------------  /* auto */
/*E66*/ int32_t top;  // ---------------------------------  /* auto */
/*E6A*/ int32_t right;  // -------------------------------  /* auto */
/*E6E*/ int32_t bottom;  // ------------------------------  /* auto */
/*E72*/ int32_t fE72;  // --------------------------------  /* auto */
/*E76*/ int32_t fE76;  // --------------------------------  /* auto */
/*E7A*/ int32_t fE7A;  // --------------------------------  /* auto */
/*E7E*/ int32_t fE7E;  // --------------------------------  /* auto */
/*E82*/ int32_t fE82;  // --------------------------------  /* auto */
/*E86*/ int32_t fE86;  // --------------------------------  /* auto */
/*E8A*/ int32_t fE8A;  // --------------------------------  /* auto */
/*E8E*/ int32_t fE8E;  // --------------------------------  /* auto */
/*E92*/ int32_t fE92;  // --------------------------------  /* auto */
/*E96*/ int32_t fE96;  // --------------------------------  /* auto */
/*E9A*/ int32_t fE9A;  // --------------------------------  /* auto */
/*E9E*/ int32_t fE9E;  // --------------------------------  /* auto */
/*EA2*/ int32_t fEA2;  // --------------------------------  /* auto */
/*EA6*/ int32_t fEA6;  // --------------------------------  /* auto */
/*EAA*/ int32_t fEAA;  // --------------------------------  /* auto */
/*EAE*/ int32_t fEAE;  // --------------------------------  /* auto */
/*EB2*/ float fEB2;  // ----------------------------------  /* auto */
/*EB6*/ float fEB6;  // ----------------------------------  /* auto */
/*EBA*/ int32_t fEBA;  // --------------------------------  /* auto */
/*EBE*/ int32_t fEBE;  // --------------------------------  /* auto */
/*EC2*/ int32_t fEC2;  // --------------------------------  /* auto */
/*EC6*/ int32_t fEC6;  // --------------------------------  /* auto */
/*ECA*/ int32_t fECA;  // --------------------------------  /* auto */
/*ECE*/ int32_t timeMs_ECE;  // --------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*00449470*/ CCamera *constructor();  // -----------------  /* auto */
/*00449670*/ int32_t fun_449670();  // -------------------  /* auto */
/*004499E0*/ int32_t fun_4499E0(int32_t *);  // ----------  /* auto */
/*00449AC0*/ int32_t sub_449AC0(int32_t *);  // ----------  /* auto */
/*00449B30*/ int32_t sub_449B30();  // -------------------  /* auto */
/*00449BD0*/ int32_t fun_449BD0(Vec3i *);  // ------------  /* auto */
/*00449CA0*/ void zoomRel_449CA0(int32_t);  // -----------  /* auto */
/*00449D00*/ float *fun_449D00(int16_t *, int16_t *, int16_t *);  /* auto */
/*00449D40*/ int32_t fun_449D40(int16_t *, int16_t *, int16_t *);  /* auto */
/*00449F50*/ float *fun_449F50(int16_t *);  // -----------  /* auto */
/*0044A370*/ char sub_44A370(int32_t, int32_t, int32_t, int32_t);  /* auto */
/*0044A5D0*/ int32_t sub_44A5D0(int32_t, int32_t);  // ---  /* auto */
/*0044A9E0*/ int32_t sub_44A9E0(int32_t, int32_t);  // ---  /* auto */
/*0044ACE0*/ int32_t sub_44ACE0(int32_t, int16_t);  // ---  /* auto */
/*0044BD70*/ __int16 sub_44BD70(int32_t);  // ------------  /* auto */
/*0044BED0*/ int32_t sub_44BED0(int32_t);  // ------------  /* auto */
/*0044CFB0*/ int32_t fun_44CFB0(int32_t);  // ------------  /* auto */
/*0044D320*/ int32_t fun_44D320(int32_t);  // ------------  /* auto */
/*0044D590*/ BOOL fun_44D590();  // ----------------------  /* auto */
/*0044D6D0*/ float *fun_44D6D0();  // --------------------  /* auto */
/*0044D8F0*/ int32_t sub_44D8F0();  // -------------------  /* auto */
/*0044DC70*/ float *fun_44DC70(int32_t);  // -------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(CCamera) == 0xED2);  // -------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //C_CAMERA_H  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
