// -----------------  id: vtbl_0066ED1C  -----------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef C_GUI_MANAGER_H  // ------------------------------  /* auto */
#define C_GUI_MANAGER_H  // ------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/AABB.h>  // --------------------------------  /* auto */
#include <dk2/CWindow.h>  // -----------------------------  /* auto */
#include <dk2/Pos2i.h>  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct CDefaultPlayerInterface;  // --------------------  /* auto */
  struct CGuiManager;  // --------------------------------  /* auto */
  struct Size2i;  // -------------------------------------  /* auto */
  struct WindowCfg;  // ----------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct CGuiManager {  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  4*/ int32_t width;  // -------------------------------  /* auto */
/*  8*/ int32_t height;  // ------------------------------  /* auto */
/*  C*/ int32_t isButtonVisited;  // ---------------------  /* auto */
/* 10*/ int32_t f10;  // ---------------------------------  /* auto */
/* 14*/ int32_t f14;  // ---------------------------------  /* auto */
/* 18*/ int32_t f18;  // ---------------------------------  /* auto */
/* 1C*/ int32_t f1C;  // ---------------------------------  /* auto */
/* 20*/ int32_t f20;  // ---------------------------------  /* auto */
/* 24*/ int32_t f24;  // ---------------------------------  /* auto */
/* 28*/ CWindow window;  // ------------------------------  /* auto */
/* 98*/ CWindow *pWindow_first;  // ----------------------  /* auto */
/* 9C*/ CWindow *currentWin;  // -------------------------  /* auto */
/* A0*/ int32_t fA0;  // ---------------------------------  /* auto */
/* A4*/ int32_t fA4;  // ---------------------------------  /* auto */
/* A8*/ int32_t fA8;  // ---------------------------------  /* auto */
/* AC*/ Pos2i mousePos;  // ------------------------------  /* auto */
/* B4*/ Pos2i pos;  // -----------------------------------  /* auto */
/* BC*/ int32_t is_clicked;  // --------------------------  /* auto */
/* C0*/ int32_t fC0;  // ---------------------------------  /* auto */
/* C4*/ int32_t fC4;  // ---------------------------------  /* auto */
/* C8*/ int32_t fC8;  // ---------------------------------  /* auto */
/* CC*/ AABB pos_CC;  // ---------------------------------  /* auto */
/* DC*/ int8_t gap_DC[256];  // --------------------------  /* auto */
/*1DC*/ int32_t f1DC;  // --------------------------------  /* auto */
/*1E0*/ int32_t f1E0;  // --------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*0066ED1C*/ static void **vftable();  // ----------------  /* auto */
/*---*/ // CGuiManager  ----------------------------------  /* auto */
/*  0*/ virtual void *v__scalar_deleting_destructor_uint(char);  // = 0052B8C0  /* auto */
// -------------------------------------------------------  /* auto */
/*0052B870*/ CGuiManager *constructor();  // -------------  /* auto */
/*0052B8E0*/ void destructor();  // ----------------------  /* auto */
/*0052B8F0*/ int32_t createElements(WindowCfg **, CDefaultPlayerInterface *);  /* auto */
/*0052BBD0*/ int32_t doDraw2dGui(int32_t);  // -----------  /* auto */
/*0052BC50*/ int32_t sub_52BC50(CDefaultPlayerInterface *);  /* auto */
/*0052BFC0*/ int32_t probably_isCursorAtButton();  // ----  /* auto */
/*0052C2F0*/ void onWmChar(wchar_t, int32_t);  // --------  /* auto */
/*0052C520*/ BOOL sub_52C520();  // ----------------------  /* auto */
/*0052C540*/ CWindow *findGameWindowById(int32_t);  // ---  /* auto */
/*0052C5A0*/ Pos2i *scaleSize(Pos2i *, Size2i *);  // ----  /* auto */
/*0052C5F0*/ Pos2i *sub_52C5F0(Pos2i *, Pos2i *);  // ----  /* auto */
/*0052C630*/ AABB *scaleAabb(AABB *, AABB *);  // --------  /* auto */
/*0052CCB0*/ int32_t sub_52CCB0();  // -------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(CGuiManager) == 0x1E4);  // ---------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //C_GUI_MANAGER_H  --------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
