// -----------------  id: vtbl_0066D3E4  -----------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef C_MAP_H  // --------------------------------------  /* auto */
#define C_MAP_H  // --------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/CMapEntry.h>  // ---------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct CMap;  // ---------------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct CMap {  // ----------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  4*/ int32_t f4;  // ----------------------------------  /* auto */
/*  8*/ int8_t gap_8[4];  // -----------------------------  /* auto */
/*  C*/ int32_t fC;  // ----------------------------------  /* auto */
/* 10*/ int32_t f10;  // ---------------------------------  /* auto */
/* 14*/ int32_t f14;  // ---------------------------------  /* auto */
/* 18*/ int32_t f18;  // ---------------------------------  /* auto */
/* 1C*/ int32_t f1C;  // ---------------------------------  /* auto */
/* 20*/ int8_t gap_20[260];  // --------------------------  /* auto */
/*124*/ CMapEntry entries[225];  // ----------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*0066D3E4*/ static void **vftable();  // ----------------  /* auto */
/*---*/ // CMap  -----------------------------------------  /* auto */
/*  0*/ virtual int32_t v_fun_44F4B0(int32_t *);  // = 0044F4B0  /* auto */
/*  4*/ virtual BOOL v_fun_44F3F0(int32_t *);  // = 0044F3F0  /* auto */
/*  8*/ virtual int32_t v_f8();  // = 0044F580  ----------  /* auto */
/*  C*/ virtual int32_t v_fun_4B4C20();  // = 004B4C20  --  /* auto */
// -------------------------------------------------------  /* auto */
/*0044E250*/ CMap *constructor();  // --------------------  /* auto */
/*0044E290*/ void destructor();  // ----------------------  /* auto */
/*0044F3F0*/ BOOL fun_44F3F0(int32_t *);  // -------------  /* auto */
/*0044F4B0*/ int32_t *fun_44F4B0(int32_t *);  // ---------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(CMap) == 0xACF);  // ----------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //C_MAP_H  ----------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
