// -----------------  id: vtbl_0066D99C  -----------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef C_PLAYER_H  // -----------------------------------  /* auto */
#define C_PLAYER_H  // -----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/CCreaturePool.h>  // -----------------------  /* auto */
#include <dk2/CTag.h>  // --------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct CPlayer;  // ------------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct CPlayer : CTag {  // ------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  6*/ int32_t f6;  // ----------------------------------  /* auto */
/*  A*/ int32_t fA;  // ----------------------------------  /* auto */
/*  E*/ int32_t fE;  // ----------------------------------  /* auto */
/* 12*/ int32_t f12;  // ---------------------------------  /* auto */
/* 16*/ int8_t gap_16[32];  // ---------------------------  /* auto */
/* 36*/ __int16 f36;  // ---------------------------------  /* auto */
/* 38*/ __int16 prevIdx;  // -----------------------------  /* auto */
/* 3A*/ __int16 nextIdx;  // -----------------------------  /* auto */
/* 3C*/ int32_t f3C;  // ---------------------------------  /* auto */
/* 40*/ int32_t dungeonHeartHealth;  // ------------------  /* auto */
/* 44*/ int32_t f44;  // ---------------------------------  /* auto */
/* 48*/ int32_t f48;  // ---------------------------------  /* auto */
/* 4C*/ __int16 f4C;  // ---------------------------------  /* auto */
/* 4E*/ int32_t f4E;  // ---------------------------------  /* auto */
/* 52*/ int32_t f52;  // ---------------------------------  /* auto */
/* 56*/ int32_t f56;  // ---------------------------------  /* auto */
/* 5A*/ int32_t f5A;  // ---------------------------------  /* auto */
/* 5E*/ int32_t f5E;  // ---------------------------------  /* auto */
/* 62*/ int32_t f62;  // ---------------------------------  /* auto */
/* 66*/ int32_t f66;  // ---------------------------------  /* auto */
/* 6A*/ int32_t f6A;  // ---------------------------------  /* auto */
/* 6E*/ int32_t f6E;  // ---------------------------------  /* auto */
/* 72*/ int32_t f72;  // ---------------------------------  /* auto */
/* 76*/ char plstruct;  // -------------------------------  /* auto */
/* 77*/ int8_t gap_77[7];  // ----------------------------  /* auto */
/* 7E*/ int32_t money;  // -------------------------------  /* auto */
/* 82*/ int32_t mana;  // --------------------------------  /* auto */
/* 86*/ int32_t manaPerSecondMultiplier;  // -------------  /* auto */
/* 8A*/ int8_t f8a_gap[399];  // -------------------------  /* auto */
/*219*/ int32_t f219;  // --------------------------------  /* auto */
/*21D*/ int8_t gap_21D[2052];  // ------------------------  /* auto */
/*A21*/ int32_t fA21;  // --------------------------------  /* auto */
/*A25*/ int8_t gap_A25[260];  // -------------------------  /* auto */
/*B29*/ int32_t fB29;  // --------------------------------  /* auto */
/*B2D*/ int32_t fB2D;  // --------------------------------  /* auto */
/*B31*/ int32_t fB31;  // --------------------------------  /* auto */
/*B35*/ int8_t gap_B35[34];  // --------------------------  /* auto */
/*B57*/ int8_t fb57_gap[915];  // ------------------------  /* auto */
/*EEA*/ wchar_t playerName[32];  // ----------------------  /* auto */
/*F2A*/ int8_t ff2a_gap[440];  // ------------------------  /* auto */
/*10E2*/ int32_t manaPerSecondExtra;  // -----------------  /* auto */
/*10E6*/ int32_t manaPerSecond;  // ----------------------  /* auto */
/*10EA*/ int32_t maxMana;  // ----------------------------  /* auto */
/*10EE*/ int8_t f10ee_gap[12];  // -----------------------  /* auto */
/*10FA*/ char struc;  // ---------------------------------  /* auto */
/*10FB*/ int8_t f10fb_gap[1];  // ------------------------  /* auto */
/*10FC*/ char struc_10FC;  // ----------------------------  /* auto */
/*10FD*/ int32_t f10FD;  // ------------------------------  /* auto */
/*1101*/ int8_t gap_1101[4];  // -------------------------  /* auto */
/*1105*/ int32_t f1105;  // ------------------------------  /* auto */
/*1109*/ CCreaturePool creaturePool;  // -----------------  /* auto */
/*111D*/ int32_t f111D;  // ------------------------------  /* auto */
/*1121*/ int32_t f1121;  // ------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*0066D99C*/ static void **vftable();  // ----------------  /* auto */
/*---*/ // super CTag  -----------------------------------  /* auto */
/*  0*/ // virtual void *v_deleting_destructor(char);  // = 004C1FB0  /* auto */
/*  4*/ // virtual BOOL v_f4(void **);  // = 004B8D40  ---  /* auto */
/*---*/ // CPlayer  --------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*004B8450*/ void constructor();  // ---------------------  /* auto */
/*004B85A0*/ void destructor();  // ----------------------  /* auto */
/*004B8C30*/ void sub_4B8C30();  // ----------------------  /* auto */
/*004B8D40*/ int32_t fun_4B8D40(void **);  // ------------  /* auto */
/*004B9740*/ void Player_cpp_4B9740();  // ---------------  /* auto */
/*004B9EC0*/ int32_t tick();  // -------------------------  /* auto */
/*004BA8D0*/ wchar_t *setName(wchar_t *);  // ------------  /* auto */
/*004BFB80*/ int16_t sub_4BFB80();  // -------------------  /* auto */
/*004C0090*/ BOOL sub_4C0090();  // ----------------------  /* auto */
/*004C1770*/ int32_t fun_4C1770();  // -------------------  /* auto */
/*004C17A0*/ int32_t sub_4C17A0();  // -------------------  /* auto */
/*004C3340*/ void fun_4C3340();  // ----------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(CPlayer) == 0x1125);  // ------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //C_PLAYER_H  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
