// -----------------  id: vtbl_0066D404  -----------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef C_STATE_H  // ------------------------------------  /* auto */
#define C_STATE_H  // ------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct CState;  // -------------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct CState {  // --------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  4*/ int32_t ppened;  // ------------------------------  /* auto */
/*  8*/ int8_t gap_8[8];  // -----------------------------  /* auto */
/* 10*/ int32_t currentStateId;  // ----------------------  /* auto */
/* 14*/ int32_t gameTickLastUpdated;  // -----------------  /* auto */
/* 18*/ int32_t startedAt;  // ---------------------------  /* auto */
/* 1C*/ int32_t age;  // ---------------------------------  /* auto */
/* 20*/ int8_t obj_20;  // -------------------------------  /* auto */
/* 21*/ int8_t gap_21[27];  // ---------------------------  /* auto */
/* 3C*/ int32_t mood;  // --------------------------------  /* auto */
/* 40*/ int8_t gap_40[217];  // --------------------------  /* auto */
/*119*/ int32_t f119;  // --------------------------------  /* auto */
/*11D*/ int32_t f11D;  // --------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*0066D404*/ static void **vftable();  // ----------------  /* auto */
/*---*/ // CState  ---------------------------------------  /* auto */
/*  0*/ virtual BOOL v_fun_476CF0(int32_t *);  // = 00476CF0  /* auto */
/*  4*/ virtual BOOL v_fun_476CB0(const void **);  // = 00476CB0  /* auto */
/*  8*/ virtual int32_t v_ret_1_0args_0();  // = 004B4C20   /* auto */
/*  C*/ virtual const void *v_duplicate_2_1();  // = 004B4C20  /* auto */
// -------------------------------------------------------  /* auto */
/*00476B10*/ CState *constructor();  // ------------------  /* auto */
/*00479200*/ void dump();  // ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(CState) == 0x121);  // --------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //C_STATE_H  --------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
