// -------------  id: instance_arr_006CBFA8  -------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef CVT_ITEM_H  // -----------------------------------  /* auto */
#define CVT_ITEM_H  // -----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct CvtItem {  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ int32_t code;  // --------------------------------  /* auto */
/*  4*/ char acode[8];  // -------------------------------  /* auto */
/*  C*/ void *name;  // ----------------------------------  /* auto */
/* 10*/ char short_name[4];  // --------------------------  /* auto */
/* 14*/ void *country;  // -------------------------------  /* auto */
/* 18*/ char short_country[4];  // -----------------------  /* auto */
/* 1C*/ char acode2[8];  // ------------------------------  /* auto */
/* 24*/ char acode3[8];  // ------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(CvtItem) == 0x2C);  // --------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //CVT_ITEM_H  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
