// -----------  id: call_malloc_arr_0055764F  ------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef DX_D3D_INFO_H  // --------------------------------  /* auto */
#define DX_D3D_INFO_H  // --------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct DxD3dInfo {  // -----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ char name[30];  // -------------------------------  /* auto */
/* 1E*/ char desc[80];  // -------------------------------  /* auto */
/* 6E*/ GUID *pGuid;  // ---------------------------------  /* auto */
/* 72*/ GUID guid;  // -----------------------------------  /* auto */
/* 82*/ int32_t f82;  // ---------------------------------  /* auto */
/* 86*/ D3DDEVICEDESC devDesc;  // -----------------------  /* auto */
/*182*/ int32_t hasDesc;  // -----------------------------  /* auto */
/*186*/ int32_t texCapsAnd1;  // -------------------------  /* auto */
/*18A*/ int32_t hasZbuffer;  // --------------------------  /* auto */
/*18E*/ int32_t f18E;  // --------------------------------  /* auto */
/*192*/ int32_t f192;  // --------------------------------  /* auto */
/*196*/ int32_t f196;  // --------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(DxD3dInfo) == 0x19A);  // -----------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //DX_D3D_INFO_H  ----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
