// --------------  id: construct_005227B5  ---------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef GAME_ACTION_CTX_H  // ----------------------------  /* auto */
#define GAME_ACTION_CTX_H  // ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/GameAction.h>  // --------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct GameActionCtx;  // ------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct GameActionCtx {  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ int8_t nextIdx;  // ------------------------------  /* auto */
/*  1*/ int32_t f1;  // ----------------------------------  /* auto */
/*  5*/ int32_t f5;  // ----------------------------------  /* auto */
/*  9*/ int32_t f9;  // ----------------------------------  /* auto */
/*  D*/ char fD;  // -------------------------------------  /* auto */
/*  E*/ char fE;  // -------------------------------------  /* auto */
/*  F*/ char fF;  // -------------------------------------  /* auto */
/* 10*/ int8_t f10;  // ----------------------------------  /* auto */
/* 11*/ GameAction actionArr[16];  // --------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*005272C0*/ char fun_5272C0(int32_t);  // ---------------  /* auto */
/*00527330*/ int32_t addAction(GameAction *);  // --------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(GameActionCtx) == 0x131);  // -------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //GAME_ACTION_CTX_H  ------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
