// ---------------  id: call_new_005A7A89  ---------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MOVIE_CTX_H  // ----------------------------------  /* auto */
#define MOVIE_CTX_H  // ----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MovieCtx;  // -----------------------------------  /* auto */
  struct MovieRenderer;  // ------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MovieCtx {  // ------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ MovieRenderer *renderer;  // ---------------------  /* auto */
/*  4*/ int32_t width;  // -------------------------------  /* auto */
/*  8*/ int32_t height;  // ------------------------------  /* auto */
/*  C*/ int32_t fC;  // ----------------------------------  /* auto */
/* 10*/ int32_t f10;  // ---------------------------------  /* auto */
/* 14*/ int32_t x;  // -----------------------------------  /* auto */
/* 18*/ int32_t y;  // -----------------------------------  /* auto */
/* 1C*/ const void *buf_0x124F80;  // --------------------  /* auto */
/* 20*/ const void *buf_0x493E0;  // ---------------------  /* auto */
/* 24*/ const char *f24;  // -----------------------------  /* auto */
/* 28*/ const void *buf_0x493E0_;  // --------------------  /* auto */
/* 2C*/ int32_t f2C;  // ---------------------------------  /* auto */
/* 30*/ int32_t f30;  // ---------------------------------  /* auto */
/* 34*/ int32_t f34;  // ---------------------------------  /* auto */
/* 38*/ int32_t f38;  // ---------------------------------  /* auto */
/* 3C*/ int32_t f3C;  // ---------------------------------  /* auto */
/* 40*/ int32_t f40;  // ---------------------------------  /* auto */
/* 44*/ int32_t f44;  // ---------------------------------  /* auto */
/* 48*/ int32_t f48;  // ---------------------------------  /* auto */
/* 4C*/ int32_t _singleOffscr;  // -----------------------  /* auto */
/* 50*/ int32_t f50;  // ---------------------------------  /* auto */
/* 54*/ int32_t f54;  // ---------------------------------  /* auto */
/* 58*/ int32_t f58;  // ---------------------------------  /* auto */
/* 5C*/ int32_t soundFreq;  // ---------------------------  /* auto */
/* 60*/ int32_t f60;  // ---------------------------------  /* auto */
/* 64*/ int32_t f64;  // ---------------------------------  /* auto */
/* 68*/ int32_t f68;  // ---------------------------------  /* auto */
/* 6C*/ int8_t gap_6C[24];  // ---------------------------  /* auto */
/* 84*/ int32_t f84;  // ---------------------------------  /* auto */
/* 88*/ int8_t gap_88[28];  // ---------------------------  /* auto */
/* A4*/ const void *fA4_;  // ----------------------------  /* auto */
/* A8*/ int8_t gap_A8[320];  // --------------------------  /* auto */
/*1E8*/ int32_t f1E8;  // --------------------------------  /* auto */
/*1EC*/ int8_t gap_1EC[8];  // ---------------------------  /* auto */
/*1F4*/ int32_t f1F4;  // --------------------------------  /* auto */
/*1F8*/ int8_t gap_1F8[368];  // -------------------------  /* auto */
/*368*/ int32_t f368;  // --------------------------------  /* auto */
/*36C*/ int32_t soundBufferBytes;  // --------------------  /* auto */
/*370*/ int32_t f370;  // --------------------------------  /* auto */
/*374*/ int32_t f374;  // --------------------------------  /* auto */
/*378*/ int32_t f378;  // --------------------------------  /* auto */
/*37C*/ int32_t f37C;  // --------------------------------  /* auto */
/*380*/ int32_t f380;  // --------------------------------  /* auto */
/*384*/ int32_t f384;  // --------------------------------  /* auto */
/*388*/ int32_t f388;  // --------------------------------  /* auto */
/*38C*/ int32_t f38C;  // --------------------------------  /* auto */
/*390*/ int32_t f390;  // --------------------------------  /* auto */
/*394*/ int32_t f394;  // --------------------------------  /* auto */
/*398*/ int32_t f398;  // --------------------------------  /* auto */
/*39C*/ int32_t f39C;  // --------------------------------  /* auto */
/*3A0*/ int32_t f3A0;  // --------------------------------  /* auto */
/*3A4*/ int32_t f3A4;  // --------------------------------  /* auto */
/*3A8*/ int32_t f3A8;  // --------------------------------  /* auto */
/*3AC*/ int32_t f3AC;  // --------------------------------  /* auto */
/*3B0*/ int32_t f3B0;  // --------------------------------  /* auto */
/*3B4*/ int32_t f3B4;  // --------------------------------  /* auto */
/*3B8*/ int32_t seekPos;  // -----------------------------  /* auto */
/*3BC*/ int32_t atomicLong2;  // -------------------------  /* auto */
/*3C0*/ int32_t atomicLong3;  // -------------------------  /* auto */
/*3C4*/ int32_t hThread;  // -----------------------------  /* auto */
/*3C8*/ int32_t f3C8;  // --------------------------------  /* auto */
/*3CC*/ int32_t f3CC;  // --------------------------------  /* auto */
/*3D0*/ int32_t f3D0;  // --------------------------------  /* auto */
/*3D4*/ int32_t f3D4;  // --------------------------------  /* auto */
/*3D8*/ int32_t f3D8;  // --------------------------------  /* auto */
/*3DC*/ int32_t f3DC;  // --------------------------------  /* auto */
/*3E0*/ int32_t f3E0;  // --------------------------------  /* auto */
/*3E4*/ int32_t f3E4;  // --------------------------------  /* auto */
/*3E8*/ int32_t f3E8;  // --------------------------------  /* auto */
/*3EC*/ int32_t f3EC;  // --------------------------------  /* auto */
/*3F0*/ int32_t f3F0;  // --------------------------------  /* auto */
/*3F4*/ int32_t f3F4;  // --------------------------------  /* auto */
/*3F8*/ int8_t gap_3F8[16];  // --------------------------  /* auto */
/*408*/ int32_t f408;  // --------------------------------  /* auto */
/*40C*/ int8_t gap_40C[252];  // -------------------------  /* auto */
/*508*/ int32_t f508;  // --------------------------------  /* auto */
/*50C*/ int32_t f50C;  // --------------------------------  /* auto */
/*510*/ int32_t f510;  // --------------------------------  /* auto */
/*514*/ int8_t gap_514[244];  // -------------------------  /* auto */
/*608*/ int32_t f608;  // --------------------------------  /* auto */
/*60C*/ int32_t f60C;  // --------------------------------  /* auto */
/*610*/ int8_t gap_610[8];  // ---------------------------  /* auto */
/*618*/ int32_t tickCount;  // ---------------------------  /* auto */
/*61C*/ int32_t tickCount_61C;  // -----------------------  /* auto */
/*620*/ int8_t gap_620[8];  // ---------------------------  /* auto */
/*628*/ int32_t f628;  // --------------------------------  /* auto */
/*62C*/ int32_t f62C;  // --------------------------------  /* auto */
/*630*/ int32_t f630;  // --------------------------------  /* auto */
/*634*/ int32_t f634;  // --------------------------------  /* auto */
/*638*/ int32_t f638;  // --------------------------------  /* auto */
/*63C*/ int32_t f63C;  // --------------------------------  /* auto */
/*640*/ int32_t f640;  // --------------------------------  /* auto */
/*644*/ int32_t f644;  // --------------------------------  /* auto */
/*648*/ int8_t *buf;  // ---------------------------------  /* auto */
/*64C*/ int32_t f64C;  // --------------------------------  /* auto */
/*650*/ int32_t f650;  // --------------------------------  /* auto */
/*654*/ int32_t f654;  // --------------------------------  /* auto */
/*658*/ const void *buf_658;  // -------------------------  /* auto */
/*65C*/ const void *buf_65C;  // -------------------------  /* auto */
/*660*/ int32_t buf_660;  // -----------------------------  /* auto */
/*664*/ int32_t buf_664;  // -----------------------------  /* auto */
/*668*/ int32_t buf_668;  // -----------------------------  /* auto */
/*66C*/ int32_t endBuf;  // ------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*005A7CE0*/ int32_t sub_5A7CE0();  // -------------------  /* auto */
/*005A7EA0*/ int32_t selectSmth();  // -------------------  /* auto */
/*005A89E0*/ int32_t cleanup();  // ----------------------  /* auto */
/*005A8E10*/ int32_t sub_5A8E10();  // -------------------  /* auto */
/*005A8F10*/ MovieRenderer *sub_5A8F10();  // ------------  /* auto */
/*005A9050*/ void sub_5A9050();  // ----------------------  /* auto */
/*005A95E0*/ MovieRenderer *sub_5A95E0();  // ------------  /* auto */
/*005A9620*/ int32_t sub_5A9620();  // -------------------  /* auto */
/*005A9B20*/ MovieRenderer *sub_5A9B20();  // ------------  /* auto */
/*005A9D50*/ int32_t collectSurfSize();  // --------------  /* auto */
/*005AA0B0*/ int32_t sub_5AA0B0();  // -------------------  /* auto */
/*005AA160*/ void sub_5AA160();  // ----------------------  /* auto */
/*005AA2B0*/ MovieRenderer *sub_5AA2B0();  // ------------  /* auto */
/*005AABF0*/ MovieRenderer *sub_5AABF0();  // ------------  /* auto */
/*005AB430*/ int32_t createSurfaces();  // ---------------  /* auto */
/*005AB9F0*/ int32_t sub_5AB9F0();  // -------------------  /* auto */
/*005AC180*/ int32_t sub_5AC180();  // -------------------  /* auto */
/*005AC210*/ BOOL createThread();  // --------------------  /* auto */
/*005AC250*/ int32_t sub_5AC250();  // -------------------  /* auto */
/*005AC2A0*/ int32_t initDirectSound();  // --------------  /* auto */
/*005AC3E0*/ int32_t sub_5AC3E0();  // -------------------  /* auto */
/*005AC450*/ int32_t initSound();  // --------------------  /* auto */
/*005AC640*/ int32_t sub_5AC640();  // -------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MovieCtx) == 0x670);  // ------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MOVIE_CTX_H  ------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
