// --------------  id: construct_0062D2BB  ---------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_CHAR_RENDER_CTX_H  // -------------------------  /* auto */
#define MY_CHAR_RENDER_CTX_H  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct FontObjWr;  // ----------------------------------  /* auto */
  struct MyTextFont;  // ---------------------------------  /* auto */
  struct Pos2i;  // --------------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyCharRenderCtx {  // -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ int16_t fontChrIdx;  // --------------------------  /* auto */
/*  2*/ int8_t gap_A[2];  // -----------------------------  /* auto */
/*  4*/ int32_t chrType;  // -----------------------------  /* auto */
/*  8*/ char *strPos;  // --------------------------------  /* auto */
/*  C*/ FontObjWr *fontObjWr;  // ------------------------  /* auto */
/* 10*/ MyTextFont *textFont;  // ------------------------  /* auto */
/* 14*/ int32_t obj_14;  // ------------------------------  /* auto */
/* 18*/ char f18;  // ------------------------------------  /* auto */
/* 19*/ int8_t gap_21[3];  // ----------------------------  /* auto */
/* 1C*/ int32_t index;  // -------------------------------  /* auto */
/* 20*/ int32_t arr;  // ---------------------------------  /* auto */
/* 24*/ Pos2i *pChrStart;  // ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyCharRenderCtx) == 0x28);  // ------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_CHAR_RENDER_CTX_H  ---------------------------  /* auto */
// -------------------------------------------------------  /* auto */
