// -----------------  id: get_0063381B  ------------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_FONT_ENTRY_HEADER_H  // -----------------------  /* auto */
#define MY_FONT_ENTRY_HEADER_H  // -----------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyFontEntryHeader {  // ---------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ wchar_t chr;  // ---------------------------------  /* auto */
/*  2*/ int8_t gap_2[2];  // -----------------------------  /* auto */
/*  4*/ int32_t f4;  // ----------------------------------  /* auto */
/*  8*/ int32_t dataSize;  // ----------------------------  /* auto */
/*  C*/ int32_t flags;  // -------------------------------  /* auto */
/* 10*/ __int16 width;  // -------------------------------  /* auto */
/* 12*/ __int16 height;  // ------------------------------  /* auto */
/* 14*/ char offsX;  // ----------------------------------  /* auto */
/* 15*/ char offsY;  // ----------------------------------  /* auto */
/* 16*/ __int16 outerWidth;  // --------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyFontEntryHeader) == 0x18);  // ----  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_FONT_ENTRY_HEADER_H  -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
