// --------------  id: construct_00559836  ---------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_GAME_F4_C_H  // -------------------------------  /* auto */
#define MY_GAME_F4_C_H  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/PixelMask.h>  // ---------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MyGame_f4C;  // ---------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyGame_f4C {  // ----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ char f0;  // -------------------------------------  /* auto */
/*  1*/ char f1;  // -------------------------------------  /* auto */
/*  2*/ char f2;  // -------------------------------------  /* auto */
/*  3*/ char f3;  // -------------------------------------  /* auto */
/*  4*/ char f4;  // -------------------------------------  /* auto */
/*  5*/ char f5;  // -------------------------------------  /* auto */
/*  6*/ char f6;  // -------------------------------------  /* auto */
/*  7*/ char f7;  // -------------------------------------  /* auto */
/*  8*/ char f8;  // -------------------------------------  /* auto */
/*  9*/ char f9;  // -------------------------------------  /* auto */
/*  A*/ char fA;  // -------------------------------------  /* auto */
/*  B*/ char fB;  // -------------------------------------  /* auto */
/*  C*/ char fC;  // -------------------------------------  /* auto */
/*  D*/ char fD;  // -------------------------------------  /* auto */
/*  E*/ char fE;  // -------------------------------------  /* auto */
/*  F*/ char fF;  // -------------------------------------  /* auto */
/* 10*/ char f10;  // ------------------------------------  /* auto */
/* 11*/ char f11;  // ------------------------------------  /* auto */
/* 12*/ char f12;  // ------------------------------------  /* auto */
/* 13*/ char f13;  // ------------------------------------  /* auto */
/* 14*/ PixelMask pixelMask;  // -------------------------  /* auto */
/* 19*/ int32_t f19;  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*00559820*/ char fun_559820(int32_t);  // ---------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyGame_f4C) == 0x1D);  // -----------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_GAME_F4_C_H  ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
