// -----------------  id: vtbl_00674058  -----------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_UNK674058_H  // -------------------------------  /* auto */
#define MY_UNK674058_H  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/AABB.h>  // --------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MyUnk674058;  // --------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyUnk674058 {  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  4*/ int32_t f4;  // ----------------------------------  /* auto */
/*  8*/ int8_t gap_8[12];  // ----------------------------  /* auto */
/* 14*/ char f14;  // ------------------------------------  /* auto */
/* 15*/ char f15;  // ------------------------------------  /* auto */
/* 16*/ int8_t gap_16[2];  // ----------------------------  /* auto */
/* 18*/ int32_t f18;  // ---------------------------------  /* auto */
/* 1C*/ int8_t f1C;  // ----------------------------------  /* auto */
/* 1D*/ int8_t gap_1D[3];  // ----------------------------  /* auto */
/* 20*/ int32_t f20;  // ---------------------------------  /* auto */
/* 24*/ int8_t gap_24[4];  // ----------------------------  /* auto */
/* 28*/ int32_t file_storage;  // ------------------------  /* auto */
/* 2C*/ int8_t gap_2C[4];  // ----------------------------  /* auto */
/* 30*/ char f30;  // ------------------------------------  /* auto */
/* 31*/ int8_t gap_31[3];  // ----------------------------  /* auto */
/* 34*/ int32_t f34;  // ---------------------------------  /* auto */
/* 38*/ int32_t f38;  // ---------------------------------  /* auto */
/* 3C*/ int32_t f3C;  // ---------------------------------  /* auto */
/* 40*/ int32_t f40;  // ---------------------------------  /* auto */
/* 44*/ int32_t f44;  // ---------------------------------  /* auto */
/* 48*/ int32_t f48;  // ---------------------------------  /* auto */
/* 4C*/ int32_t f4C;  // ---------------------------------  /* auto */
/* 50*/ int32_t f50;  // ---------------------------------  /* auto */
/* 54*/ int32_t f54;  // ---------------------------------  /* auto */
/* 58*/ int32_t f58;  // ---------------------------------  /* auto */
/* 5C*/ int32_t f5C;  // ---------------------------------  /* auto */
/* 60*/ char f60;  // ------------------------------------  /* auto */
/* 61*/ int8_t gap_61[3];  // ----------------------------  /* auto */
/* 64*/ int32_t f64;  // ---------------------------------  /* auto */
/* 68*/ int32_t f68;  // ---------------------------------  /* auto */
/* 6C*/ int32_t f6C;  // ---------------------------------  /* auto */
/* 70*/ int32_t f70;  // ---------------------------------  /* auto */
/* 74*/ int32_t f74;  // ---------------------------------  /* auto */
/* 78*/ int32_t f78;  // ---------------------------------  /* auto */
/* 7C*/ int32_t f7C;  // ---------------------------------  /* auto */
/* 80*/ int32_t f80;  // ---------------------------------  /* auto */
/* 84*/ int32_t f84;  // ---------------------------------  /* auto */
/* 88*/ int32_t f88;  // ---------------------------------  /* auto */
/* 8C*/ int32_t f8C;  // ---------------------------------  /* auto */
/* 90*/ char f90;  // ------------------------------------  /* auto */
/* 91*/ int8_t gap_91[3];  // ----------------------------  /* auto */
/* 94*/ int32_t f94;  // ---------------------------------  /* auto */
/* 98*/ int32_t f98;  // ---------------------------------  /* auto */
/* 9C*/ int32_t f9C;  // ---------------------------------  /* auto */
/* A0*/ int32_t fA0;  // ---------------------------------  /* auto */
/* A4*/ int32_t fA4;  // ---------------------------------  /* auto */
/* A8*/ int32_t fA8;  // ---------------------------------  /* auto */
/* AC*/ int32_t fAC;  // ---------------------------------  /* auto */
/* B0*/ int32_t fB0;  // ---------------------------------  /* auto */
/* B4*/ int32_t fB4;  // ---------------------------------  /* auto */
/* B8*/ int32_t fB8;  // ---------------------------------  /* auto */
/* BC*/ int32_t fBC;  // ---------------------------------  /* auto */
/* C0*/ char fC0;  // ------------------------------------  /* auto */
/* C1*/ int8_t gap_C1[3];  // ----------------------------  /* auto */
/* C4*/ int32_t fC4;  // ---------------------------------  /* auto */
/* C8*/ int32_t fC8;  // ---------------------------------  /* auto */
/* CC*/ int32_t *fCC;  // --------------------------------  /* auto */
/* D0*/ int32_t fD0;  // ---------------------------------  /* auto */
/* D4*/ AABB fD4;  // ------------------------------------  /* auto */
/* E4*/ int32_t fE4;  // ---------------------------------  /* auto */
/* E8*/ int32_t fE8;  // ---------------------------------  /* auto */
/* EC*/ int32_t fEC;  // ---------------------------------  /* auto */
/* F0*/ int32_t fF0;  // ---------------------------------  /* auto */
/* F4*/ int32_t fF4;  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*00674058*/ static void **vftable();  // ----------------  /* auto */
/*---*/ // MyUnk674058  ----------------------------------  /* auto */
/*  0*/ virtual const void *v_sub_60F450(char);  // = 0060F450  /* auto */
// -------------------------------------------------------  /* auto */
/*0060F230*/ MyUnk674058 *constructor();  // -------------  /* auto */
/*0060F4E0*/ void destructor();  // ----------------------  /* auto */
/*00610070*/ int32_t sub_610070(int32_t, int32_t *);  // -  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyUnk674058) == 0xF8);  // ----------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_UNK674058_H  ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
