// ---------------  id: call_new_005FE640  ---------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_WAD_UNK_OBJ_H  // -----------------------------  /* auto */
#define MY_WAD_UNK_OBJ_H  // -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/MyStr.h>  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MyWadUnkObj;  // --------------------------------  /* auto */
  struct TbCharStringList_vtbl;  // ----------------------  /* auto */
  struct WadContent;  // ---------------------------------  /* auto */
  struct WadDirObj;  // ----------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyWadUnkObj {  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ MyStr str1;  // ----------------------------------  /* auto */
/* 14*/ WadDirObj *dir;  // ------------------------------  /* auto */
/* 18*/ int32_t f18;  // ---------------------------------  /* auto */
/* 1C*/ int32_t f1C;  // ---------------------------------  /* auto */
/* 20*/ MyStr str2;  // ----------------------------------  /* auto */
/* 34*/ char f34;  // ------------------------------------  /* auto */
/* 35*/ char f35;  // ------------------------------------  /* auto */
/* 36*/ int8_t gap_36[2];  // ----------------------------  /* auto */
/* 38*/ int32_t f38;  // ---------------------------------  /* auto */
/* 3C*/ TbCharStringList_vtbl *__vftable_3C;  // ---------  /* auto */
/* 40*/ int8_t gap_40[12];  // ---------------------------  /* auto */
/* 4C*/ TbCharStringList_vtbl *__vftable_4C;  // ---------  /* auto */
/* 50*/ int32_t f50;  // ---------------------------------  /* auto */
/* 54*/ int32_t f54;  // ---------------------------------  /* auto */
/* 58*/ int32_t f58;  // ---------------------------------  /* auto */
/* 5C*/ int32_t _end_f5C;  // ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*005FEF70*/ void sub_5FEF70(WadContent *, MyStr *, int32_t *);  /* auto */
/*005FF2B0*/ char sub_5FF2B0();  // ----------------------  /* auto */
/*005FF3D0*/ bool sub_5FF3D0();  // ----------------------  /* auto */
/*005FF3F0*/ const char *sub_5FF3F0(int32_t);  // --------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyWadUnkObj) == 0x60);  // ----------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_WAD_UNK_OBJ_H  -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
