// -------------  id: constructor_0057AD20  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef OBJ57_AD20_H  // ---------------------------------  /* auto */
#define OBJ57_AD20_H  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/Vec3f.h>  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct CPolyMeshResource;  // --------------------------  /* auto */
  struct Mat3x3f;  // ------------------------------------  /* auto */
  struct Obj57AD20;  // ----------------------------------  /* auto */
  struct SceneObject2E;  // ------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct Obj57AD20 {  // -----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ int32_t sprsCount;  // ---------------------------  /* auto */
/*  4*/ int32_t f4;  // ----------------------------------  /* auto */
/*  8*/ Vec3f vec;  // -----------------------------------  /* auto */
/* 14*/ Vec3f vec_14;  // --------------------------------  /* auto */
/* 20*/ const float *f20;  // ----------------------------  /* auto */
/* 24*/ int32_t f24;  // ---------------------------------  /* auto */
/* 28*/ int32_t f28;  // ---------------------------------  /* auto */
/* 2C*/ int32_t f2C;  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*0057A9A0*/ int32_t *sub_57A9A0(int32_t, SceneObject2E *, int32_t, int32_t, int32_t, int32_t, int32_t, float);  /* auto */
/*0057AC40*/ int32_t sub_57AC40(int32_t, int32_t, int32_t *, int32_t *);  /* auto */
/*0057AD20*/ Obj57AD20 *constructor(CPolyMeshResource *, Vec3f *, Mat3x3f *, Vec3f *, char);  /* auto */
/*0057AFF0*/ int32_t sub_57AFF0(int32_t *);  // ----------  /* auto */
/*0057B0E0*/ int32_t *sub_57B0E0(int32_t, SceneObject2E *, int32_t, int32_t, int32_t, int32_t, int32_t, float);  /* auto */
/*0057B6D0*/ int32_t *sub_57B6D0(int32_t, SceneObject2E *, int32_t, int32_t, int32_t, int32_t, float);  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(Obj57AD20) == 0x30);  // ------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //OBJ57_AD20_H  -----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
