// -----------------  id: vtbl_00672E70  -----------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef OBJ672_E70_H  // ---------------------------------  /* auto */
#define OBJ672_E70_H  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MySurfDesc;  // ---------------------------------  /* auto */
  struct Obj672E70;  // ----------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct Obj672E70 {  // -----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  4*/ int8_t arr[1024];  // ----------------------------  /* auto */
/*404*/ int32_t f404;  // --------------------------------  /* auto */
/*408*/ int32_t f408;  // --------------------------------  /* auto */
/*40C*/ int32_t f40C;  // --------------------------------  /* auto */
/*410*/ int32_t f410;  // --------------------------------  /* auto */
/*414*/ int32_t s_dwRBitMask;  // ------------------------  /* auto */
/*418*/ int32_t s_dwGBitMask;  // ------------------------  /* auto */
/*41C*/ int32_t dwBBitMask;  // --------------------------  /* auto */
/*420*/ int32_t f420;  // --------------------------------  /* auto */
/*424*/ int32_t f424;  // --------------------------------  /* auto */
/*428*/ int32_t f428;  // --------------------------------  /* auto */
/*42C*/ int32_t f42C;  // --------------------------------  /* auto */
/*430*/ int32_t f430;  // --------------------------------  /* auto */
/*434*/ int32_t f434;  // --------------------------------  /* auto */
/*438*/ int32_t f438;  // --------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*00672E70*/ static void **vftable();  // ----------------  /* auto */
/*---*/ // Obj672E70  ------------------------------------  /* auto */
/*  0*/ virtual const void *v_Obj672E70_scalar_destructor(char);  // = 005FD1B0  /* auto */
/*  4*/ virtual int32_t v_Obj672E70_convertPixel(int8_t *, int32_t *, int32_t);  // = 005FD3E0  /* auto */
/*  8*/ virtual int32_t v_Obj672E70_selfConvertPixel(int32_t, int32_t, int32_t);  // = 005FD510  /* auto */
// -------------------------------------------------------  /* auto */
/*005FD220*/ int32_t *init(MySurfDesc *, const void *);     /* auto */
/*005FD3E0*/ char convertPixel(int8_t *, int32_t *, int32_t);  /* auto */
/*005FD510*/ int32_t selfConvertPixel(int32_t, int32_t, int32_t);  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(Obj672E70) == 0x43C);  // -----------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //OBJ672_E70_H  -----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
