// -----------------  id: vtbl_00672510  -----------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef OBJ672510_H  // ----------------------------------  /* auto */
#define OBJ672510_H  // ----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MySurfDesc;  // ---------------------------------  /* auto */
  struct Obj672510;  // ----------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct Obj672510 {  // -----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  4*/ int32_t f4;  // ----------------------------------  /* auto */
/*  8*/ int32_t f8;  // ----------------------------------  /* auto */
/*  C*/ int32_t fC;  // ----------------------------------  /* auto */
/* 10*/ int32_t f10;  // ---------------------------------  /* auto */
/* 14*/ int32_t s1_dwRBitMask;  // -----------------------  /* auto */
/* 18*/ int32_t s1_dwGBitMask;  // -----------------------  /* auto */
/* 1C*/ int32_t s1_dwBBitMask;  // -----------------------  /* auto */
/* 20*/ int32_t s2_dwRGBAlphaBitMask;  // ----------------  /* auto */
/* 24*/ int32_t s2_dwRBitMask;  // -----------------------  /* auto */
/* 28*/ int32_t s2_dwGBitMask;  // -----------------------  /* auto */
/* 2C*/ int32_t s2_dwBBitMask;  // -----------------------  /* auto */
/* 30*/ int32_t s2_dwRGBAlphaBitMask_30;  // -------------  /* auto */
/* 34*/ int32_t f34;  // ---------------------------------  /* auto */
/* 38*/ int32_t f38;  // ---------------------------------  /* auto */
/* 3C*/ int32_t f3C;  // ---------------------------------  /* auto */
/* 40*/ int32_t f40;  // ---------------------------------  /* auto */
/* 44*/ int32_t s2_dwRGBBitCount_align8;  // -------------  /* auto */
/* 48*/ int32_t s1_dwRGBBitCount_align8;  // -------------  /* auto */
/* 4C*/ int32_t f4C;  // ---------------------------------  /* auto */
/* 50*/ int32_t f50;  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*00672510*/ static void **vftable();  // ----------------  /* auto */
/*---*/ // Obj672510  ------------------------------------  /* auto */
/*  0*/ virtual const void *v_Obj672520Interface_scalar_destructor(char);  // = 005D2840  /* auto */
/*  4*/ virtual Obj672510 *v_Obj672510_convertPixel(int8_t *, int32_t *, int32_t);  // = 005FBCA0  /* auto */
/*  8*/ virtual Obj672510 *v_Obj672510_selfConvertPixel(int32_t, int32_t, int32_t);  // = 005FC460  /* auto */
// -------------------------------------------------------  /* auto */
/*005FBBD0*/ int32_t init(MySurfDesc *, MySurfDesc *);      /* auto */
/*005FBCA0*/ Obj672510 *convertPixel(int8_t *, int32_t *, int32_t);  /* auto */
/*005FC460*/ Obj672510 *selfConvertPixel(int32_t, int32_t, int32_t);  /* auto */
/*005FCC20*/ int32_t *sub_5FCC20(int32_t, int32_t, int32_t *, int32_t *);  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(Obj672510) == 0x54);  // ------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //OBJ672510_H  ------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
