// -----------------  id: vtbl_00672844  -----------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef OBJ672844_H  // ----------------------------------  /* auto */
#define OBJ672844_H  // ----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct CursorDrawer;  // -------------------------------  /* auto */
  struct Obj6723B8;  // ----------------------------------  /* auto */
  struct Obj672844;  // ----------------------------------  /* auto */
  struct Pos2i;  // --------------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct Obj672844 {  // -----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  4*/ Obj6723B8 *pobj;  // -----------------------------  /* auto */
/*  8*/ const void *hSema;  // ---------------------------  /* auto */
/*  C*/ int32_t hThread;  // -----------------------------  /* auto */
/* 10*/ char f10;  // ------------------------------------  /* auto */
/* 11*/ char aBool;  // ----------------------------------  /* auto */
/* 12*/ char _doDrawCursor;  // --------------------------  /* auto */
/* 13*/ int8_t f13;  // ----------------------------------  /* auto */
/* 14*/ int32_t timestamp;  // ---------------------------  /* auto */
/* 18*/ int32_t timestampDelta;  // ----------------------  /* auto */
/* 1C*/ CursorDrawer *cursorDrawer;  // ------------------  /* auto */
/* 20*/ Pos2i *pMousePos;  // ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*00672844*/ static void **vftable();  // ----------------  /* auto */
/*---*/ // Obj672844  ------------------------------------  /* auto */
/*  0*/ virtual const void *v_Obj672844_scalar_destructor(char);  // = 005DB800  /* auto */
// -------------------------------------------------------  /* auto */
/*005DB7C0*/ Obj672844 *constructor(Obj6723B8 *);  // ----  /* auto */
/*005DB870*/ const void *clearSurfsAndJoin();  // --------  /* auto */
/*005DB890*/ const void *joinThread();  // ---------------  /* auto */
/*005DB8E0*/ char drawCursor(int32_t);  // ---------------  /* auto */
/*005DB940*/ char waitForSema(int8_t);  // ---------------  /* auto */
/*005DBA40*/ int32_t *initAndUpdateAabb(int32_t *, Pos2i *);  /* auto */
/*005DBAA0*/ int32_t *sub_5DBAA0(int32_t *, char);  // ---  /* auto */
/*005DBAC0*/ int32_t *sub_5DBAC0(int32_t *, int32_t, int32_t, int32_t);  /* auto */
/*005DBB10*/ void updateCursor();  // --------------------  /* auto */
/*005DBB60*/ int32_t sub_5DBB60();  // -------------------  /* auto */
/*005DBBB0*/ int32_t sub_5DBBB0();  // -------------------  /* auto */
/*005DBBE0*/ int32_t updateAabb();  // -------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(Obj672844) == 0x24);  // ------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //OBJ672844_H  ------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
