// -------------  id: instance_arr_006A1EC8  -------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef STUB_STRUC6_A1_EC8_H  // -------------------------  /* auto */
#define STUB_STRUC6_A1_EC8_H  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct StubStruc6A1EC8 {  // -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ char f0;  // -------------------------------------  /* auto */
/*  1*/ const void *f1;  // ------------------------------  /* auto */
/*  5*/ const void *f5;  // ------------------------------  /* auto */
/*  9*/ const void *f9;  // ------------------------------  /* auto */
/*  D*/ const void *fD;  // ------------------------------  /* auto */
/* 11*/ const void *f11;  // -----------------------------  /* auto */
/* 15*/ const void *f15;  // -----------------------------  /* auto */
/* 19*/ int32_t f19;  // ---------------------------------  /* auto */
/* 1D*/ int32_t f1D;  // ---------------------------------  /* auto */
/* 21*/ int32_t f21;  // ---------------------------------  /* auto */
/* 25*/ int32_t f25;  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(StubStruc6A1EC8) == 0x29);  // ------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //STUB_STRUC6_A1_EC8_H  ---------------------------  /* auto */
// -------------------------------------------------------  /* auto */
