// ---------------  id: call_new_0059425F  ---------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef SURF_HASH_LIST_ITEM_H  // ------------------------  /* auto */
#define SURF_HASH_LIST_ITEM_H  // ------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct SurfHashListItem;  // ---------------------------  /* auto */
  struct SurfaceHolder;  // ------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct SurfHashListItem {  // ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ SurfaceHolder *holder_link;  // ------------------  /* auto */
/*  4*/ SurfHashListItem *next;  // ----------------------  /* auto */
/*  8*/ SurfHashListItem *prev;  // ----------------------  /* auto */
/*  C*/ SurfHashListItem *quadtree2x2[2][2];  // ---------  /* auto */
/* 1C*/ int16_t width_257;  // ---------------------------  /* auto */
/* 1E*/ int16_t height_257;  // --------------------------  /* auto */
/* 20*/ char x;  // --------------------------------------  /* auto */
/* 21*/ char y;  // --------------------------------------  /* auto */
/* 22*/ char _aBool;  // ---------------------------------  /* auto */
/* 23*/ char f23;  // ------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*00591F90*/ SurfHashListItem *recursive_scalar_delete(char);  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(SurfHashListItem) == 0x24);  // -----  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //SURF_HASH_LIST_ITEM_H  --------------------------  /* auto */
// -------------------------------------------------------  /* auto */
