// --------------  id: construct_00588C1A  ---------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef TRIANGLE34_H  // ---------------------------------  /* auto */
#define TRIANGLE34_H  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct SurfaceHolder;  // ------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct Triangle34 {  // ----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ int32_t prevTriangleIdx;  // ---------------------  /* auto */
/*  4*/ int32_t props_flags;  // -------------------------  /* auto */
/*  8*/ SurfaceHolder *holders[3];  // -------------------  /* auto */
/* 14*/ int32_t surfhCount;  // --------------------------  /* auto */
/* 18*/ int32_t srcX;  // --------------------------------  /* auto */
/* 1C*/ int32_t srcY;  // --------------------------------  /* auto */
/* 20*/ int32_t dstX;  // --------------------------------  /* auto */
/* 24*/ int32_t dstY;  // --------------------------------  /* auto */
/* 28*/ int32_t width;  // -------------------------------  /* auto */
/* 2C*/ int32_t height;  // ------------------------------  /* auto */
/* 30*/ int32_t unk;  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(Triangle34) == 0x34);  // -----------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //TRIANGLE34_H  -----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
