// -------------  id: call_new_arr_005FE715  -------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef WAD_ENTRY_H  // ----------------------------------  /* auto */
#define WAD_ENTRY_H  // ----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct WadEntry {  // ------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ int32_t idx;  // ---------------------------------  /* auto */
/*  4*/ int32_t nameOffset;  // --------------------------  /* auto */
/*  8*/ int32_t nameSize;  // ----------------------------  /* auto */
/*  C*/ int32_t fileOffset;  // --------------------------  /* auto */
/* 10*/ int32_t compressedSize;  // ----------------------  /* auto */
/* 14*/ int32_t compressType;  // ------------------------  /* auto */
/* 18*/ int32_t size;  // --------------------------------  /* auto */
/* 1C*/ int32_t f1C;  // ---------------------------------  /* auto */
/* 20*/ int32_t f20;  // ---------------------------------  /* auto */
/* 24*/ int32_t f24;  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(WadEntry) == 0x28);  // -------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //WAD_ENTRY_H  ------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
