// ---------------  id: Creature_Instance  ---------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_CREATURE_INST_H  // ---------------------------  /* auto */
#define MY_CREATURE_INST_H  // ---------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/utils/Vec3i.h>  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MyCreatureInst;  // -----------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyCreatureInst {  // ------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ Vec3i target;  // --------------------------------  /* auto */
/*  C*/ int32_t data1;  // -------------------------------  /* auto */
/* 10*/ int32_t data2;  // -------------------------------  /* auto */
/* 14*/ int32_t data3;  // -------------------------------  /* auto */
/* 18*/ int32_t startTime;  // ---------------------------  /* auto */
/* 1C*/ int32_t type;  // --------------------------------  /* auto */
/* 20*/ uint8_t duoComplete;  // -------------------------  /* auto */
/* 21*/ char playCounter;  // ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*0049A5E0*/ void dump();  // ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyCreatureInst) == 0x22);  // -------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_CREATURE_INST_H  -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
