// ---------------  id: instance_00760AB8  ---------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_CAMERA_STATE_H  // ----------------------------  /* auto */
#define MY_CAMERA_STATE_H  // ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/utils/Mat3x3f.h>  // -----------------------  /* auto */
#include <dk2/utils/Vec2f.h>  // -------------------------  /* auto */
#include <dk2/utils/Vec3f.h>  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyCameraState {  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ Vec3f v3f;  // -----------------------------------  /* auto */
/*  C*/ Mat3x3f m;  // -----------------------------------  /* auto */
/* 30*/ float ww240;  // ---------------------------------  /* auto */
/* 34*/ Vec2f leftRight;  // -----------------------------  /* auto */
/* 3C*/ Vec2f topBottom;  // -----------------------------  /* auto */
/* 44*/ Vec2f trg;  // -----------------------------------  /* auto */
/* 4C*/ float zoom;  // ----------------------------------  /* auto */
/* 50*/ int32_t flags;  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyCameraState) == 0x54);  // --------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_CAMERA_STATE_H  ------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
