// --------------  id: construct_005369D1  ---------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_STRING_TEXTURE_H  // --------------------------  /* auto */
#define MY_STRING_TEXTURE_H  // --------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct AABB;  // ---------------------------------------  /* auto */
  struct MySurface;  // ----------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyStringTexture {  // -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ int32_t string_MB;  // ---------------------------  /* auto */
/*  4*/ MySurface *surf_360C;  // ------------------------  /* auto */
/*  8*/ MySurface *surf_39A4;  // ------------------------  /* auto */
/*  C*/ AABB *aabb;  // ----------------------------------  /* auto */
/* 10*/ AABB *cur_aabb;  // ------------------------------  /* auto */
/* 14*/ int32_t psmth;  // -------------------------------  /* auto */
/* 18*/ int32_t _0;  // ----------------------------------  /* auto */
/* 1C*/ char _3;  // -------------------------------------  /* auto */
/* 1D*/ int32_t fontObjType;  // -------------------------  /* auto */
/* 21*/ int32_t _2;  // ----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyStringTexture) == 0x25);  // ------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_STRING_TEXTURE_H  ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
