// -------------  id: constructor_0062D530  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_TR_CTX2_SUB_H  // -----------------------------  /* auto */
#define MY_TR_CTX2_SUB_H  // -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MyTRCtx2Sub;  // --------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyTRCtx2Sub {  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ uint32_t f0;  // ---------------------------------  /* auto */
/*  4*/ uint32_t f4;  // ---------------------------------  /* auto */
/*  8*/ uint32_t f8;  // ---------------------------------  /* auto */
/*  C*/ uint32_t fC;  // ---------------------------------  /* auto */
/* 10*/ int32_t f10;  // ---------------------------------  /* auto */
/* 14*/ int32_t f14;  // ---------------------------------  /* auto */
/* 18*/ char f18;  // ------------------------------------  /* auto */
/* 19*/ uint8_t gap_19[3];  // ---------------------------  /* auto */
/* 1C*/ int32_t f1C;  // ---------------------------------  /* auto */
/* 20*/ int32_t f20;  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*0062D530*/ MyTRCtx2Sub *constructor();  // -------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyTRCtx2Sub) == 0x24);  // ----------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_TR_CTX2_SUB_H  -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
