// -------------  id: constructor_00449470  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef C_CAMERA_H  // -----------------------------------  /* auto */
#define C_CAMERA_H  // -----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/utils/AABB.h>  // --------------------------  /* auto */
#include <dk2/utils/Mat3x3f.h>  // -----------------------  /* auto */
#include <dk2/My_sub_56F850.h>  // -----------------------  /* auto */
#include <dk2/utils/Vec3f.h>  // -------------------------  /* auto */
#include <dk2/utils/Vec3i.h>  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct CCamera;  // ------------------------------------  /* auto */
  struct TbDiscFile;  // ---------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct CCamera {  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ uint32_t f0;  // ---------------------------------  /* auto */
/*  4*/ Mat3x3f matrix;  // ------------------------------  /* auto */
/* 28*/ My_sub_56F850 My_sub_56F850_arr_x22[22];  // -----  /* auto */
/*D38*/ uint32_t fD38;  // -------------------------------  /* auto */
/*D3C*/ uint32_t fD3C;  // -------------------------------  /* auto */
/*D40*/ uint32_t fD40;  // -------------------------------  /* auto */
/*D44*/ int32_t fD44;  // --------------------------------  /* auto */
/*D48*/ int32_t fD48;  // --------------------------------  /* auto */
/*D4C*/ int32_t fD4C;  // --------------------------------  /* auto */
/*D50*/ uint32_t minZoomLevel;  // -----------------------  /* auto */
/*D54*/ uint32_t maxZoomLevel;  // -----------------------  /* auto */
/*D58*/ uint32_t fD58;  // -------------------------------  /* auto */
/*D5C*/ uint32_t fD5C;  // -------------------------------  /* auto */
/*D60*/ uint32_t fD60;  // -------------------------------  /* auto */
/*D64*/ uint32_t fD64;  // -------------------------------  /* auto */
/*D68*/ Vec3i arrx3__worldCameraPos;  // -----------------  /* auto */
/*D74*/ Vec3i arrx3;  // ---------------------------------  /* auto */
/*D80*/ uint32_t curZoomLevel;  // -----------------------  /* auto */
/*D84*/ uint16_t fD84;  // -------------------------------  /* auto */
/*D86*/ __int16 fD86;  // --------------------------------  /* auto */
/*D88*/ __int16 fD88;  // --------------------------------  /* auto */
/*D8A*/ int32_t fD8A;  // --------------------------------  /* auto */
/*D8E*/ uint32_t fD8E;  // -------------------------------  /* auto */
/*D92*/ char fD92;  // -----------------------------------  /* auto */
/*D93*/ uint8_t gapD93[3];  // ---------------------------  /* auto */
/*D96*/ Vec3i arrx3_D96;  // -----------------------------  /* auto */
/*DA2*/ uint8_t gap_DA2[6];  // --------------------------  /* auto */
/*DA8*/ uint32_t _mode;  // ------------------------------  /* auto */
/*DAC*/ uint32_t fDAC;  // -------------------------------  /* auto */
/*DB0*/ uint32_t fDB0;  // -------------------------------  /* auto */
/*DB4*/ uint16_t fDB4;  // -------------------------------  /* auto */
/*DB6*/ Vec3i arrx3_DB6;  // -----------------------------  /* auto */
/*DC2*/ uint32_t fDC2;  // -------------------------------  /* auto */
/*DC6*/ __int16 fDC6;  // --------------------------------  /* auto */
/*DC8*/ __int16 fDC8;  // --------------------------------  /* auto */
/*DCA*/ uint16_t fDCA;  // -------------------------------  /* auto */
/*DCC*/ uint32_t fDCC;  // -------------------------------  /* auto */
/*DD0*/ uint32_t fDD0;  // -------------------------------  /* auto */
/*DD4*/ uint32_t _mode_cpyf;  // -------------------------  /* auto */
/*DD8*/ int32_t fDD8;  // --------------------------------  /* auto */
/*DDC*/ uint8_t gap_DDC[4];  // --------------------------  /* auto */
/*DE0*/ uint32_t fDE0;  // -------------------------------  /* auto */
/*DE4*/ uint32_t fDE4;  // -------------------------------  /* auto */
/*DE8*/ uint32_t fDE8;  // -------------------------------  /* auto */
/*DEC*/ uint16_t fDEC;  // -------------------------------  /* auto */
/*DEE*/ Vec3i arrx3_DEE;  // -----------------------------  /* auto */
/*DFA*/ int32_t fDFA;  // --------------------------------  /* auto */
/*DFE*/ int32_t fDFE;  // --------------------------------  /* auto */
/*E02*/ uint16_t fE02;  // -------------------------------  /* auto */
/*E04*/ Vec3i arrx3_E04;  // -----------------------------  /* auto */
/*E10*/ int32_t fE10;  // --------------------------------  /* auto */
/*E14*/ int32_t fE14;  // --------------------------------  /* auto */
/*E18*/ int32_t timeMs;  // ------------------------------  /* auto */
/*E1C*/ __int16 fE1C;  // --------------------------------  /* auto */
/*E1E*/ __int16 fE1E;  // --------------------------------  /* auto */
/*E20*/ int32_t fE20;  // --------------------------------  /* auto */
/*E24*/ int32_t timeMs_E24;  // --------------------------  /* auto */
/*E28*/ int32_t fE28;  // --------------------------------  /* auto */
/*E2C*/ int32_t fE2C;  // --------------------------------  /* auto */
/*E30*/ int32_t timeMs_E30;  // --------------------------  /* auto */
/*E34*/ int32_t fE34;  // --------------------------------  /* auto */
/*E38*/ int32_t fE38;  // --------------------------------  /* auto */
/*E3C*/ uint32_t flags;  // ------------------------------  /* auto */
/*E40*/ int32_t timeMs_E40;  // --------------------------  /* auto */
/*E44*/ int32_t fE44;  // --------------------------------  /* auto */
/*E48*/ uint16_t fE48;  // -------------------------------  /* auto */
/*E4A*/ uint32_t timeMs_E4A;  // -------------------------  /* auto */
/*E4E*/ int32_t fE4E;  // --------------------------------  /* auto */
/*E52*/ AABB fE52;  // -----------------------------------  /* auto */
/*E62*/ int32_t left;  // --------------------------------  /* auto */
/*E66*/ int32_t top;  // ---------------------------------  /* auto */
/*E6A*/ int32_t right;  // -------------------------------  /* auto */
/*E6E*/ int32_t bottom;  // ------------------------------  /* auto */
/*E72*/ AABB fE72;  // -----------------------------------  /* auto */
/*E82*/ int32_t fE82;  // --------------------------------  /* auto */
/*E86*/ int32_t fE86;  // --------------------------------  /* auto */
/*E8A*/ int32_t fE8A;  // --------------------------------  /* auto */
/*E8E*/ int32_t fE8E;  // --------------------------------  /* auto */
/*E92*/ AABB fE92;  // -----------------------------------  /* auto */
/*EA2*/ Mat3x3f *fEA2;  // -------------------------------  /* auto */
/*EA6*/ Vec3f *fEA6;  // ---------------------------------  /* auto */
/*EAA*/ int32_t fEAA;  // --------------------------------  /* auto */
/*EAE*/ int32_t fEAE;  // --------------------------------  /* auto */
/*EB2*/ Vec3f fEB2;  // ----------------------------------  /* auto */
/*EBE*/ int32_t fEBE;  // --------------------------------  /* auto */
/*EC2*/ int32_t fEC2;  // --------------------------------  /* auto */
/*EC6*/ int32_t fEC6;  // --------------------------------  /* auto */
/*ECA*/ int32_t fECA;  // --------------------------------  /* auto */
/*ECE*/ int32_t timeMs_ECE;  // --------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*00449470*/ CCamera *constructor();  // -----------------  /* auto */
/*00449670*/ int32_t fun_449670();  // -------------------  /* auto */
/*00449840*/ AABB *fun_449840(AABB *);  // ---------------  /* auto */
/*004498F0*/ int32_t fun_4498F0(AABB *);  // -------------  /* auto */
/*004499A0*/ BOOL saveToTbDiscFile(TbDiscFile **);  // ---  /* auto */
/*004499E0*/ int32_t fun_4499E0(int32_t *);  // ----------  /* auto */
/*00449A30*/ int32_t fun_449A30(uint8_t *);  // ----------  /* auto */
/*00449AC0*/ int32_t fun_449AC0(uint32_t *);  // ---------  /* auto */
/*00449B30*/ int32_t sub_449B30();  // -------------------  /* auto */
/*00449BD0*/ int32_t fun_449BD0(Vec3i *);  // ------------  /* auto */
/*00449C30*/ int32_t fun_449C30(int32_t, int32_t);  // ---  /* auto */
/*00449CA0*/ void zoomRel_449CA0(int32_t);  // -----------  /* auto */
/*00449D00*/ Mat3x3f *fun_449D00(uint16_t *, uint16_t *, uint16_t *);  /* auto */
/*00449D40*/ int32_t fun_449D40(uint16_t *, uint16_t *, uint16_t *);  /* auto */
/*00449F50*/ Mat3x3f *fun_449F50(uint16_t *);  // --------  /* auto */
/*00449F70*/ int32_t fun_449F70(int32_t);  // ------------  /* auto */
/*00449FC0*/ void fun_449FC0(int32_t);  // ---------------  /* auto */
/*0044A020*/ int32_t fun_44A020(int32_t *);  // ----------  /* auto */
/*0044A070*/ void fun_44A070(uint32_t *);  // ------------  /* auto */
/*0044A0D0*/ int32_t fun_44A0D0(int32_t, int32_t);  // ---  /* auto */
/*0044A100*/ int32_t fun_44A100(char, char);  // ---------  /* auto */
/*0044A150*/ int32_t fun_44A150(Vec3i *);  // ------------  /* auto */
/*0044A270*/ int32_t fun_44A270(uint32_t);  // -----------  /* auto */
/*0044A370*/ char sub_44A370(uint32_t, uint32_t, uint32_t, int32_t);  /* auto */
/*0044A500*/ int32_t fun_44A500(__int16);  // ------------  /* auto */
/*0044A520*/ int32_t fun_44A520(__int16);  // ------------  /* auto */
/*0044A550*/ int32_t fun_44A550(int32_t);  // ------------  /* auto */
/*0044A5D0*/ int32_t updateCameraMode(int32_t, int32_t);    /* auto */
/*0044A9E0*/ int32_t fun_44A9E0(int32_t, int32_t);  // ---  /* auto */
/*0044AA20*/ int32_t sub_44AA20();  // -------------------  /* auto */
/*0044AA80*/ int32_t sub_44AA80();  // -------------------  /* auto */
/*0044AB60*/ int32_t sub_44AB60();  // -------------------  /* auto */
/*0044AC80*/ int32_t sub_44AC80();  // -------------------  /* auto */
/*0044ACE0*/ int32_t sub_44ACE0(int32_t, uint16_t);  // --  /* auto */
/*0044BD70*/ __int16 sub_44BD70(int32_t);  // ------------  /* auto */
/*0044BED0*/ int32_t sub_44BED0(int32_t);  // ------------  /* auto */
/*0044CFB0*/ int32_t fun_44CFB0(int32_t);  // ------------  /* auto */
/*0044D2A0*/ int32_t fun_44D2A0(AABB *);  // -------------  /* auto */
/*0044D320*/ int32_t fun_44D320(int32_t);  // ------------  /* auto */
/*0044D550*/ double sub_44D550();  // --------------------  /* auto */
/*0044D590*/ BOOL fun_44D590();  // ----------------------  /* auto */
/*0044D620*/ BOOL fun_44D620();  // ----------------------  /* auto */
/*0044D6D0*/ Mat3x3f *fun_44D6D0();  // ------------------  /* auto */
/*0044D8F0*/ int32_t sub_44D8F0();  // -------------------  /* auto */
/*0044DC70*/ Mat3x3f *fun_44DC70(int32_t);  // -----------  /* auto */
/*0044DD40*/ __int16 fun_44DD40(int32_t);  // ------------  /* auto */
/*0044DE20*/ __int16 fun_44DE20(__int16);  // ------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(CCamera) == 0xED2);  // -------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //C_CAMERA_H  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
