// -----------------  id: vtbl_0066C4A4  -----------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef C_DEFAULT_PLAYER_INTERFACE_H  // -----------------  /* auto */
#define C_DEFAULT_PLAYER_INTERFACE_H  // -----------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/CGuiManager.h>  // -------------------------  /* auto */
#include <dk2/CRenderInfo.h>  // -------------------------  /* auto */
#include <dk2/CWorldEntry.h>  // -------------------------  /* auto */
#include <dk2/text/render/FontObj.h>  // -----------------  /* auto */
#include <dk2/MyCommands.h>  // --------------------------  /* auto */
#include <dk2/MySurface.h>  // ---------------------------  /* auto */
#include <dk2/RtGuiView.h>  // ---------------------------  /* auto */
#include <dk2/StaticListeners.h>  // ---------------------  /* auto */
#include <dk2/utils/Vec3i.h>  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct CDefaultPlayerInterface;  // --------------------  /* auto */
  struct CPlayer;  // ------------------------------------  /* auto */
  struct CWindow;  // ------------------------------------  /* auto */
  struct CWorld;  // -------------------------------------  /* auto */
  struct GameAction;  // ---------------------------------  /* auto */
  struct MyProfiler;  // ---------------------------------  /* auto */
  struct PixelMask;  // ----------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct CDefaultPlayerInterface {  // ---------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  4*/ MyProfiler *profiler;  // ------------------------  /* auto */
/*  8*/ __int16 _cpyToF10;  // ---------------------------  /* auto */
/*  A*/ int32_t _counter;  // ----------------------------  /* auto */
/*  E*/ uint8_t gap_E[32];  // ---------------------------  /* auto */
/* 2E*/ uint32_t f2E;  // --------------------------------  /* auto */
/* 32*/ uint8_t gap_32[8];  // ---------------------------  /* auto */
/* 3A*/ uint32_t f3A;  // --------------------------------  /* auto */
/* 3E*/ uint32_t f3E;  // --------------------------------  /* auto */
/* 42*/ uint32_t f42;  // --------------------------------  /* auto */
/* 46*/ uint32_t f46;  // --------------------------------  /* auto */
/* 4A*/ uint32_t f4A;  // --------------------------------  /* auto */
/* 4E*/ uint32_t f4E;  // --------------------------------  /* auto */
/* 52*/ uint8_t tickedCount_4039A0;  // ------------------  /* auto */
/* 53*/ CWorld *pCWorld;  // -----------------------------  /* auto */
/* 57*/ int32_t f57;  // ---------------------------------  /* auto */
/* 5B*/ int32_t f5B;  // ---------------------------------  /* auto */
/* 5F*/ uint8_t gap_5F[150];  // -------------------------  /* auto */
/* F5*/ uint32_t fF5;  // --------------------------------  /* auto */
/* F9*/ uint32_t f59_timestampMs;  // --------------------  /* auto */
/* FD*/ uint32_t fFD;  // --------------------------------  /* auto */
/*101*/ int32_t f101;  // --------------------------------  /* auto */
/*105*/ int32_t f105;  // --------------------------------  /* auto */
/*109*/ int32_t f109;  // --------------------------------  /* auto */
/*10D*/ int32_t f10D;  // --------------------------------  /* auto */
/*111*/ int32_t f111;  // --------------------------------  /* auto */
/*115*/ __int16 f115;  // --------------------------------  /* auto */
/*117*/ uint32_t f117;  // -------------------------------  /* auto */
/*11B*/ uint32_t f11B;  // -------------------------------  /* auto */
/*11F*/ uint32_t f11F;  // -------------------------------  /* auto */
/*123*/ uint8_t f123;  // --------------------------------  /* auto */
/*124*/ uint32_t f124;  // -------------------------------  /* auto */
/*128*/ uint16_t f128;  // -------------------------------  /* auto */
/*12A*/ uint8_t gap_12A[6];  // --------------------------  /* auto */
/*130*/ uint32_t f130;  // -------------------------------  /* auto */
/*134*/ uint16_t f134;  // -------------------------------  /* auto */
/*136*/ uint8_t gap_136[8];  // --------------------------  /* auto */
/*13E*/ uint32_t f13E;  // -------------------------------  /* auto */
/*142*/ uint8_t gap_142[88];  // -------------------------  /* auto */
/*19A*/ uint32_t f19A;  // -------------------------------  /* auto */
/*19E*/ uint8_t gap_19E[3418];  // -----------------------  /* auto */
/*EF8*/ uint32_t fEF8;  // -------------------------------  /* auto */
/*EFC*/ uint8_t gap_EFC[12];  // -------------------------  /* auto */
/*F08*/ CRenderInfo render_info;  // ---------------------  /* auto */
/*FB8*/ CRenderInfo render_info_FB8;  // -----------------  /* auto */
/*1068*/ uint32_t f1068;  // -----------------------------  /* auto */
/*106C*/ uint8_t gap_106C[12];  // -----------------------  /* auto */
/*1078*/ uint32_t f1078;  // -----------------------------  /* auto */
/*107C*/ uint32_t f107C;  // -----------------------------  /* auto */
/*1080*/ uint8_t gap_1080[10];  // -----------------------  /* auto */
/*108A*/ uint16_t f108A;  // -----------------------------  /* auto */
/*108C*/ uint8_t gap_108C[8];  // ------------------------  /* auto */
/*1094*/ int32_t f1094;  // ------------------------------  /* auto */
/*1098*/ int32_t f1098;  // ------------------------------  /* auto */
/*109C*/ int32_t pressTime;  // --------------------------  /* auto */
/*10A0*/ int32_t f10A0;  // ------------------------------  /* auto */
/*10A4*/ uint32_t f10A4;  // -----------------------------  /* auto */
/*10A8*/ uint32_t ignoreMoveKeys;  // --------------------  /* auto */
/*10AC*/ uint32_t f10AC;  // -----------------------------  /* auto */
/*10B0*/ uint32_t f10B0;  // -----------------------------  /* auto */
/*10B4*/ uint32_t f10B4;  // -----------------------------  /* auto */
/*10B8*/ uint32_t timeMs;  // ----------------------------  /* auto */
/*10BC*/ uint16_t f10BC;  // -----------------------------  /* auto */
/*10BE*/ uint8_t gap_10BE[8];  // ------------------------  /* auto */
/*10C6*/ CGuiManager cgui_manager;  // -------------------  /* auto */
/*12AA*/ uint8_t gap12AA[4];  // -------------------------  /* auto */
/*12AE*/ uint32_t f12AE;  // -----------------------------  /* auto */
/*12B2*/ uint32_t f12B2;  // -----------------------------  /* auto */
/*12B6*/ CWorldEntry *arr277;  // ------------------------  /* auto */
/*12BA*/ uint8_t gap_12BA[4];  // ------------------------  /* auto */
/*12BE*/ CWorldEntry *arr10;  // -------------------------  /* auto */
/*12C2*/ uint8_t gap_12C2[24];  // -----------------------  /* auto */
/*12DA*/ int32_t f12DA;  // ------------------------------  /* auto */
/*12DE*/ uint32_t f12DE;  // -----------------------------  /* auto */
/*12E2*/ uint32_t f12E2;  // -----------------------------  /* auto */
/*12E6*/ uint32_t timeMs_12E6;  // -----------------------  /* auto */
/*12EA*/ uint32_t f12EA;  // -----------------------------  /* auto */
/*12EE*/ uint8_t gap_12EE[4];  // ------------------------  /* auto */
/*12F2*/ int32_t f12F2;  // ------------------------------  /* auto */
/*12F6*/ uint16_t f12F6;  // -----------------------------  /* auto */
/*12F8*/ uint8_t gap_12F8[6];  // ------------------------  /* auto */
/*12FE*/ uint32_t f12FE;  // -----------------------------  /* auto */
/*1302*/ uint8_t gap_1302[12];  // -----------------------  /* auto */
/*130E*/ int32_t f130E;  // ------------------------------  /* auto */
/*1312*/ uint16_t f1312;  // -----------------------------  /* auto */
/*1314*/ uint8_t gap_1314[6];  // ------------------------  /* auto */
/*131A*/ uint32_t f131A;  // -----------------------------  /* auto */
/*131E*/ uint8_t gap_131E[12];  // -----------------------  /* auto */
/*132A*/ int32_t f132A;  // ------------------------------  /* auto */
/*132E*/ uint8_t f132E;  // ------------------------------  /* auto */
/*132F*/ int32_t f132F;  // ------------------------------  /* auto */
/*1333*/ int32_t f1333;  // ------------------------------  /* auto */
/*1337*/ int32_t f1337;  // ------------------------------  /* auto */
/*133B*/ int32_t f133B;  // ------------------------------  /* auto */
/*133F*/ StaticListeners field_133F_static_listeners;       /* auto */
/*1353*/ MyCommands commands;  // ------------------------  /* auto */
/*1367*/ uint32_t f1367;  // -----------------------------  /* auto */
/*136B*/ void *lpSurface;  // ----------------------------  /* auto */
/*136F*/ CWorldEntry worldEntry;  // ---------------------  /* auto */
/*138A*/ uint32_t f138A;  // -----------------------------  /* auto */
/*138E*/ uint8_t gap_138E[21];  // -----------------------  /* auto */
/*13A3*/ MySurface surf;  // -----------------------------  /* auto */
/*13CB*/ int32_t f13CB;  // ------------------------------  /* auto */
/*13CF*/ uint32_t f13CF;  // -----------------------------  /* auto */
/*13D3*/ uint32_t f13D3;  // -----------------------------  /* auto */
/*13D7*/ uint16_t f13D7;  // -----------------------------  /* auto */
/*13D9*/ __int16 f13D9;  // ------------------------------  /* auto */
/*13DB*/ int32_t f13DB;  // ------------------------------  /* auto */
/*13DF*/ uint8_t gap_13DF[5];  // ------------------------  /* auto */
/*13E4*/ uint32_t f13E4;  // -----------------------------  /* auto */
/*13E8*/ uint8_t gap_13E8[8];  // ------------------------  /* auto */
/*13F0*/ uint32_t f13F0;  // -----------------------------  /* auto */
/*13F4*/ uint8_t gap_13F4[5];  // ------------------------  /* auto */
/*13F9*/ uint32_t f13F9;  // -----------------------------  /* auto */
/*13FD*/ uint32_t f13FD;  // -----------------------------  /* auto */
/*1401*/ uint8_t gap_1401[8];  // ------------------------  /* auto */
/*1409*/ RtGuiView _eventMessageText;  // ----------------  /* auto */
/*16A4*/ uint8_t gap_16A4[60];  // -----------------------  /* auto */
/*16E0*/ RtGuiView _wonMpdText;  // ----------------------  /* auto */
/*197B*/ uint8_t gap_197B[9];  // ------------------------  /* auto */
/*1984*/ RtGuiView _allyWindowText;  // ------------------  /* auto */
/*1C1F*/ uint8_t gap_1C1F[806];  // ----------------------  /* auto */
/*1F45*/ RtGuiView _chatMessageHistoryWindowText;  // ----  /* auto */
/*21E0*/ RtGuiView _multiplayerMessageWindowText;  // ----  /* auto */
/*247B*/ uint8_t gap_247B[4];  // ------------------------  /* auto */
/*247F*/ uint32_t f247F;  // -----------------------------  /* auto */
/*2483*/ uint32_t f2483;  // -----------------------------  /* auto */
/*2487*/ RtGuiView _imeText;  // -------------------------  /* auto */
/*2722*/ int32_t f2722;  // ------------------------------  /* auto */
/*2726*/ uint8_t gap_2726[17];  // -----------------------  /* auto */
/*2737*/ RtGuiView _options;  // -------------------------  /* auto */
/*29D2*/ uint8_t gap_29D2[4];  // ------------------------  /* auto */
/*29D6*/ RtGuiView _optionsListBox;  // ------------------  /* auto */
/*2C71*/ RtGuiView _optionsLoadSaveBox;  // --------------  /* auto */
/*2F0C*/ RtGuiView _objectiveText;  // -------------------  /* auto */
/*31A7*/ RtGuiView _generalText;  // ---------------------  /* auto */
/*3442*/ uint8_t gap_3442[8];  // ------------------------  /* auto */
/*344A*/ RtGuiView _firstFightText;  // ------------------  /* auto */
/*36E5*/ uint8_t gap_36E5[12];  // -----------------------  /* auto */
/*36F1*/ RtGuiView _playerInfoText;  // ------------------  /* auto */
/*398C*/ uint8_t gap_398C[4];  // ------------------------  /* auto */
/*3990*/ uint32_t f3990;  // -----------------------------  /* auto */
/*3994*/ uint8_t gap_3994[512];  // ----------------------  /* auto */
/*3B94*/ uint32_t f3B94;  // -----------------------------  /* auto */
/*3B98*/ uint32_t f3B98;  // -----------------------------  /* auto */
/*3B9C*/ RtGuiView _playerNameText;  // ------------------  /* auto */
/*3E37*/ uint32_t f3E37;  // -----------------------------  /* auto */
/*3E3B*/ uint32_t f3E3B;  // -----------------------------  /* auto */
/*3E3F*/ Vec3i vecs[4];  // ------------------------------  /* auto */
/*3E6F*/ int32_t f3E6F;  // ------------------------------  /* auto */
/*3E73*/ RtGuiView _followPathSubtitleTextBuffer;  // ----  /* auto */
/*410E*/ uint32_t f410E;  // -----------------------------  /* auto */
/*4112*/ uint8_t gap_4112[4];  // ------------------------  /* auto */
/*4116*/ RtGuiView _kingOfTheHill;  // -------------------  /* auto */
/*43B1*/ uint8_t gap_43B1[4];  // ------------------------  /* auto */
/*43B5*/ RtGuiView _pointerInfo;  // ---------------------  /* auto */
/*4650*/ uint8_t gap_4650[8];  // ------------------------  /* auto */
/*4658*/ uint32_t f4658;  // -----------------------------  /* auto */
/*465C*/ uint8_t gap_465C[4];  // ------------------------  /* auto */
/*4660*/ RtGuiView _tooltip;  // -------------------------  /* auto */
/*48FB*/ uint8_t gap_48FB[540];  // ----------------------  /* auto */
/*4B17*/ uint32_t f4B17;  // -----------------------------  /* auto */
/*4B1B*/ uint16_t f4B1B;  // -----------------------------  /* auto */
/*4B1D*/ uint32_t f4B1D;  // -----------------------------  /* auto */
/*4B21*/ uint8_t gap_4B21[6];  // ------------------------  /* auto */
/*4B27*/ uint32_t f4B27;  // -----------------------------  /* auto */
/*4B2B*/ uint32_t f4B2B;  // -----------------------------  /* auto */
/*4B2F*/ uint8_t f4B2F[319];  // -------------------------  /* auto */
/*4C6E*/ uint32_t f4C6E;  // -----------------------------  /* auto */
/*4C72*/ uint8_t gap_4C72[8];  // ------------------------  /* auto */
/*4C7A*/ uint32_t f4C7A;  // -----------------------------  /* auto */
/*4C7E*/ uint8_t gap_4C7E[8];  // ------------------------  /* auto */
/*4C86*/ int32_t f4C86;  // ------------------------------  /* auto */
/*4C8A*/ int32_t f4C8A;  // ------------------------------  /* auto */
/*4C8E*/ int32_t f4C8E;  // ------------------------------  /* auto */
/*4C92*/ int32_t f4C92;  // ------------------------------  /* auto */
/*4C96*/ int32_t f4C96;  // ------------------------------  /* auto */
/*4C9A*/ int32_t f4C9A;  // ------------------------------  /* auto */
/*4C9E*/ CWorldEntry worldEntry_4C9E;  // ----------------  /* auto */
/*4CB9*/ int32_t f4CB9;  // ------------------------------  /* auto */
/*4CBD*/ uint8_t gap_4CBD[12];  // -----------------------  /* auto */
/*4CC9*/ int32_t f4CC9;  // ------------------------------  /* auto */
/*4CCD*/ int32_t f4CCD;  // ------------------------------  /* auto */
/*4CD1*/ int32_t f4CD1;  // ------------------------------  /* auto */
/*4CD5*/ int32_t f4CD5;  // ------------------------------  /* auto */
/*4CD9*/ uint8_t gap_4CD9;  // ---------------------------  /* auto */
/*4CDA*/ int32_t f4CDA;  // ------------------------------  /* auto */
/*4CDE*/ uint32_t f4CDE;  // -----------------------------  /* auto */
/*4CE2*/ uint32_t f4CE2;  // -----------------------------  /* auto */
/*4CE6*/ uint32_t f4CE6;  // -----------------------------  /* auto */
/*4CEA*/ uint32_t f4CEA;  // -----------------------------  /* auto */
/*4CEE*/ uint32_t f4CEE;  // -----------------------------  /* auto */
/*4CF2*/ uint8_t gap_4CF2[15];  // -----------------------  /* auto */
/*4D01*/ uint32_t f4D01;  // -----------------------------  /* auto */
/*4D05*/ uint32_t f4D05;  // -----------------------------  /* auto */
/*4D09*/ uint8_t gap_4D09[116];  // ----------------------  /* auto */
/*4D7D*/ uint32_t f4D7D;  // -----------------------------  /* auto */
/*4D81*/ uint8_t gap_4D81[116];  // ----------------------  /* auto */
/*4DF5*/ uint32_t f4DF5;  // -----------------------------  /* auto */
/*4DF9*/ uint8_t gap_4DF9[116];  // ----------------------  /* auto */
/*4E6D*/ uint32_t f4E6D;  // -----------------------------  /* auto */
/*4E71*/ uint8_t gap_4E71[180];  // ----------------------  /* auto */
/*4F25*/ uint32_t f4F25;  // -----------------------------  /* auto */
/*4F29*/ uint8_t gap_4F29[4];  // ------------------------  /* auto */
/*4F2D*/ int32_t f4F2D;  // ------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*0066C4A4*/ static void **vftable();  // ----------------  /* auto */
/*---*/ // CDefaultPlayerInterface  ----------------------  /* auto */
/*  0*/ virtual void *v_fun_402C00(char);  // = 00402C00    /* auto */
/*  4*/ virtual int32_t v_fun_402D00(__int16);  // = 00402D00  /* auto */
/*  8*/ virtual int32_t v_fun_4033F0();  // = 004033F0  --  /* auto */
/*  C*/ virtual int32_t v_fun_4036E0();  // = 004036E0  --  /* auto */
/* 10*/ virtual int32_t v_fun_4039A0(int32_t, int32_t, int32_t);  // = 004039A0  /* auto */
/* 14*/ virtual int32_t v_fun_403FB0();  // = 00403FB0  --  /* auto */
/* 18*/ virtual int32_t v_fun_402AD0();  // = 00402AD0  --  /* auto */
/* 1C*/ virtual int32_t v_fun_402B50(int32_t);  // = 00402B50  /* auto */
/* 20*/ virtual BOOL v_fun_4096B0();  // = 004096B0  -----  /* auto */
/* 24*/ virtual int32_t v_fun_409880();  // = 00409880  --  /* auto */
/* 28*/ virtual int32_t v_fun_4098A0();  // = 004098A0  --  /* auto */
/* 2C*/ virtual int32_t v_fun_4098D0();  // = 004098D0  --  /* auto */
/* 30*/ virtual int32_t v_fun_402B60();  // = 00402B60  --  /* auto */
/* 34*/ virtual void v_fun_402B70();  // = 00402B70  -----  /* auto */
/* 38*/ virtual void v_fun_402B80();  // = 00402B80  -----  /* auto */
/* 3C*/ virtual int32_t v_fun_42BC20();  // = 0042BC20  --  /* auto */
/* 40*/ virtual int32_t v_fun_42BE40();  // = 0042BE40  --  /* auto */
/* 44*/ virtual BOOL v_fun_42C710();  // = 0042C710  -----  /* auto */
/* 48*/ virtual int32_t v_fun_42BFE0();  // = 0042BFE0  --  /* auto */
/* 4C*/ virtual int32_t v_fun_42C0D0();  // = 0042C0D0  --  /* auto */
/* 50*/ virtual uint32_t v_fun_42C1E0(int32_t, int32_t);  // = 0042C1E0  /* auto */
/* 54*/ virtual char v_fun_402B90(char);  // = 00402B90  -  /* auto */
/* 58*/ virtual uint32_t v_fun_409EC0(__int16, const void *);  // = 00409EC0  /* auto */
// -------------------------------------------------------  /* auto */
/*00402670*/ CDefaultPlayerInterface *constructor();  // -  /* auto */
/*00402B50*/ int32_t fun_402B50(int32_t);  // ------------  /* auto */
/*00402B60*/ int32_t fun_402B60();  // -------------------  /* auto */
/*00402B70*/ void fun_402B70();  // ----------------------  /* auto */
/*00402B80*/ void fun_402B80();  // ----------------------  /* auto */
/*00402B90*/ char fun_402B90(char);  // ------------------  /* auto */
/*00402BB0*/ void *CTextIconDraw_fun_402BB0(char);  // ---  /* auto */
/*00402C00*/ void *fun_402C00(char);  // -----------------  /* auto */
/*00402C20*/ void destructor();  // ----------------------  /* auto */
/*00402D00*/ void fun_402D00(__int16);  // ---------------  /* auto */
/*004033F0*/ int32_t fun_4033F0();  // -------------------  /* auto */
/*004036E0*/ uint32_t *fun_4036E0();  // -----------------  /* auto */
/*004039A0*/ int32_t fun_4039A0(int32_t, int32_t, int32_t);  /* auto */
/*00403FB0*/ void fun_403FB0();  // ----------------------  /* auto */
/*004066A0*/ BOOL tickKeyboard(int32_t);  // -------------  /* auto */
/*00406DF0*/ int32_t tickKeyboard2();  // ----------------  /* auto */
/*00407070*/ int32_t pushMoveKeyAction(int32_t, int32_t);   /* auto */
/*00407380*/ uint32_t sub_407380();  // ------------------  /* auto */
/*004075E0*/ char sub_4075E0(int32_t, int32_t);  // ------  /* auto */
/*00408EE0*/ uint32_t sub_408EE0(uint32_t, int32_t);  // -  /* auto */
/*004094C0*/ uint32_t sub_4094C0();  // ------------------  /* auto */
/*004096B0*/ BOOL fun_4096B0();  // ----------------------  /* auto */
/*00409880*/ int32_t fun_409880();  // -------------------  /* auto */
/*004098A0*/ int32_t fun_4098A0();  // -------------------  /* auto */
/*004098D0*/ int32_t fun_4098D0();  // -------------------  /* auto */
/*00409990*/ int32_t sub_409990();  // -------------------  /* auto */
/*00409CF0*/ int32_t fun_409CF0();  // -------------------  /* auto */
/*00409EC0*/ uint32_t fun_409EC0(__int16, const void *);    /* auto */
/*0040A280*/ int32_t sub_40A280(uint8_t, uint16_t);  // --  /* auto */
/*0040A600*/ int32_t fun_40A600(int32_t, int32_t, int32_t);  /* auto */
/*0040A680*/ int32_t onWmChar(wchar_t);  // --------------  /* auto */
/*0040A760*/ BOOL applyCheatCode(BOOL);  // --------------  /* auto */
/*0040ACD0*/ int32_t sub_40ACD0();  // -------------------  /* auto */
/*0040AE80*/ char sub_40AE80();  // ----------------------  /* auto */
/*0040B160*/ int32_t sub_40B160();  // -------------------  /* auto */
/*0040B210*/ char sub_40B210();  // ----------------------  /* auto */
/*0040B3C0*/ char sub_40B3C0();  // ----------------------  /* auto */
/*0040B4F0*/ char sub_40B4F0();  // ----------------------  /* auto */
/*0040B600*/ char sub_40B600();  // ----------------------  /* auto */
/*0040BB60*/ uint32_t sub_40BB60();  // ------------------  /* auto */
/*0040BBE0*/ __int16 sub_40BBE0();  // -------------------  /* auto */
/*0040BFF0*/ __int16 sub_40BFF0(uint32_t *, int32_t);       /* auto */
/*0040CA70*/ void sub_40CA70();  // ----------------------  /* auto */
/*0040CAE0*/ void sub_40CAE0(int32_t, int32_t);  // ------  /* auto */
/*0040DAB0*/ uint32_t sub_40DAB0(int32_t, int32_t);  // --  /* auto */
/*0040DD20*/ int32_t sub_40DD20(int32_t, int32_t);  // ---  /* auto */
/*0040E0D0*/ CPlayer *sub_40E0D0();  // ------------------  /* auto */
/*0040E670*/ void sub_40E670();  // ----------------------  /* auto */
/*0040F820*/ void sub_40F820();  // ----------------------  /* auto */
/*0040FA90*/ char sub_40FA90();  // ----------------------  /* auto */
/*0040FDA0*/ int32_t sub_40FDA0();  // -------------------  /* auto */
/*0040FDF0*/ char sub_40FDF0();  // ----------------------  /* auto */
/*0040FFB0*/ BOOL sub_40FFB0();  // ----------------------  /* auto */
/*00410020*/ __int16 sub_410020();  // -------------------  /* auto */
/*004100F0*/ char sub_4100F0();  // ----------------------  /* auto */
/*00411B30*/ void sub_411B30(int32_t, int32_t, int32_t, int32_t, int32_t);  /* auto */
/*00415B30*/ int32_t sub_415B30(int32_t *);  // ----------  /* auto */
/*00415BC0*/ int32_t sub_415BC0(char);  // ---------------  /* auto */
/*00416150*/ int32_t sub_416150(uint8_t);  // ------------  /* auto */
/*004162A0*/ int32_t sub_4162A0(uint8_t);  // ------------  /* auto */
/*00419180*/ CWindow *sub_419180_loadSmth();  // ---------  /* auto */
/*00419C00*/ void sub_419C00();  // ----------------------  /* auto */
/*00419DF0*/ void sub_419DF0();  // ----------------------  /* auto */
/*0041A190*/ void sub_41A190();  // ----------------------  /* auto */
/*0041A890*/ int32_t sub_41A890(int32_t, int32_t, int32_t, int32_t, int32_t, char);  /* auto */
/*0041A9B0*/ void fun_41A9B0();  // ----------------------  /* auto */
/*0041C660*/ void sub_41C660();  // ----------------------  /* auto */
/*0041CC50*/ char *sub_41CC50();  // ---------------------  /* auto */
/*0041E620*/ int32_t sub_41E620();  // -------------------  /* auto */
/*0041EDC0*/ void fun_41EDC0();  // ----------------------  /* auto */
/*00422600*/ BOOL sub_422600(int32_t, int32_t);  // ------  /* auto */
/*00422BC0*/ void fun_422BC0(CDefaultPlayerInterface *);    /* auto */
/*00422F60*/ void sub_422F60(uint32_t, uint32_t);  // ----  /* auto */
/*0042BC10*/ int32_t sub_42BC10();  // -------------------  /* auto */
/*0042BC20*/ int32_t fun_42BC20();  // -------------------  /* auto */
/*0042BE40*/ int32_t fun_42BE40();  // -------------------  /* auto */
/*0042BFE0*/ int32_t fun_42BFE0();  // -------------------  /* auto */
/*0042C0D0*/ int32_t fun_42C0D0();  // -------------------  /* auto */
/*0042C1E0*/ uint32_t fun_42C1E0(int32_t, int32_t);  // --  /* auto */
/*0042C390*/ void sub_42C390();  // ----------------------  /* auto */
/*0042C710*/ BOOL fun_42C710();  // ----------------------  /* auto */
/*0042C7D0*/ void sub_42C7D0(int32_t, int32_t, int32_t, const char *, int32_t *);  /* auto */
/*0042CAB0*/ int32_t whatEverFont_42CAB0(RtGuiView *, int32_t, int32_t, wchar_t *, PixelMask *, int32_t, int32_t, FontObj, int32_t);  /* auto */
/*0042CB60*/ int32_t sub_42CB60(RtGuiView *, int32_t, int32_t, const char *, PixelMask *, int32_t, int32_t, FontObj, int32_t);  /* auto */
/*0042CDF0*/ int32_t createSurfacesForView_42CDF0(RtGuiView *);  /* auto */
/*0042D090*/ uint32_t *CTextIconDraw_fun_42D090(uint32_t *, int32_t, int32_t, int32_t *, uint32_t *, uint32_t *);  /* auto */
/*004346E0*/ BOOL pushAction(GameAction *);  // ----------  /* auto */
/*00555060*/ void sub_555060(int32_t);  // ---------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(CDefaultPlayerInterface) == 0x4F31);   /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //C_DEFAULT_PLAYER_INTERFACE_H  -------------------  /* auto */
// -------------------------------------------------------  /* auto */
