// -----------------  id: vtbl_0066EF3C  -----------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef C_FRONT_END_COMPONENT_H  // ----------------------  /* auto */
#define C_FRONT_END_COMPONENT_H  // ----------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/utils/AABB.h>  // --------------------------  /* auto */
#include <dk2/CComponent.h>  // --------------------------  /* auto */
#include <dk2/CGuiManager.h>  // -------------------------  /* auto */
#include <dk2/CWorldEntry.h>  // -------------------------  /* auto */
#include <dk2/MyCommands.h>  // --------------------------  /* auto */
#include <dk2/MyDdSurface.h>  // -------------------------  /* auto */
#include <dk2/MyDdSurfaceEx.h>  // -----------------------  /* auto */
#include <dk2/MySurface.h>  // ---------------------------  /* auto */
#include <dk2/StaticListeners.h>  // ---------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct CBridge;  // ------------------------------------  /* auto */
  struct CButton;  // ------------------------------------  /* auto */
  struct CFrontEndComponent;  // -------------------------  /* auto */
  struct CWindow;  // ------------------------------------  /* auto */
  struct MyStringTexture;  // ----------------------------  /* auto */
  struct NameCfg;  // ------------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct CFrontEndComponent : CComponent {  // -------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  C*/ uint32_t fC;  // ---------------------------------  /* auto */
/* 10*/ uint32_t f10;  // --------------------------------  /* auto */
/* 14*/ uint8_t gap_14[942];  // -------------------------  /* auto */
/*3C2*/ uint16_t f3C2;  // -------------------------------  /* auto */
/*3C4*/ uint8_t gap_3C4[14];  // -------------------------  /* auto */
/*3D2*/ int32_t f3D2;  // --------------------------------  /* auto */
/*3D6*/ int32_t f3D6;  // --------------------------------  /* auto */
/*3DA*/ MySurface f3DA;  // ------------------------------  /* auto */
/*402*/ uint8_t gap_402[101];  // ------------------------  /* auto */
/*467*/ int32_t timestampMs;  // -------------------------  /* auto */
/*46B*/ int32_t f46B;  // --------------------------------  /* auto */
/*46F*/ int32_t f46F;  // --------------------------------  /* auto */
/*473*/ int32_t f473;  // --------------------------------  /* auto */
/*477*/ uint8_t gap_477[8];  // --------------------------  /* auto */
/*47F*/ MyDdSurface f47F;  // ----------------------------  /* auto */
/*4A7*/ uint8_t f4a7_gap[9240];  // ----------------------  /* auto */
/*28BF*/ MySurface field_28BF_x36[36];  // ---------------  /* auto */
/*2E5F*/ int32_t f2E5F;  // ------------------------------  /* auto */
/*2E63*/ uint8_t f2e63_gap[256];  // ---------------------  /* auto */
/*2F63*/ MySurface field_2F63_x9[9];  // -----------------  /* auto */
/*30CB*/ MySurface f30CB;  // ----------------------------  /* auto */
/*30F3*/ MySurface f30F3;  // ----------------------------  /* auto */
/*311B*/ uint8_t gap_311B[145];  // ----------------------  /* auto */
/*31AC*/ MySurface f31AC[20];  // ------------------------  /* auto */
/*34CC*/ MySurface f34CC[4];  // -------------------------  /* auto */
/*356C*/ MySurface f356C[4];  // -------------------------  /* auto */
/*360C*/ MySurface surf[23];  // -------------------------  /* auto */
/*39A4*/ MySurface surf_39A4[23];  // --------------------  /* auto */
/*3D3C*/ AABB aabb0_x23[23];  // -------------------------  /* auto */
/*3EAC*/ MySurface surf1;  // ----------------------------  /* auto */
/*3ED4*/ MySurface surf2;  // ----------------------------  /* auto */
/*3EFC*/ int32_t f3EFC;  // ------------------------------  /* auto */
/*3F00*/ int32_t f3F00;  // ------------------------------  /* auto */
/*3F04*/ int32_t f3F04;  // ------------------------------  /* auto */
/*3F08*/ int32_t f3F08;  // ------------------------------  /* auto */
/*3F0C*/ MySurface surf3;  // ----------------------------  /* auto */
/*3F34*/ MySurface surf4;  // ----------------------------  /* auto */
/*3F5C*/ int32_t f3F5C;  // ------------------------------  /* auto */
/*3F60*/ int32_t f3F60;  // ------------------------------  /* auto */
/*3F64*/ int32_t f3F64;  // ------------------------------  /* auto */
/*3F68*/ int32_t f3F68;  // ------------------------------  /* auto */
/*3F6C*/ uint8_t gap_3F6C[64];  // -----------------------  /* auto */
/*3FAC*/ MySurface surf5;  // ----------------------------  /* auto */
/*3FD4*/ MySurface surf6;  // ----------------------------  /* auto */
/*3FFC*/ uint8_t gap_3FFC[384];  // ----------------------  /* auto */
/*417C*/ MySurface surf7_x3[3];  // ----------------------  /* auto */
/*41F4*/ MySurface surf8_x3[3];  // ----------------------  /* auto */
/*426C*/ MySurface surf9_x3[3];  // ----------------------  /* auto */
/*42E4*/ MySurface surf10_x3[3];  // ---------------------  /* auto */
/*435C*/ MySurface surf11;  // ---------------------------  /* auto */
/*4384*/ MySurface surf12;  // ---------------------------  /* auto */
/*43AC*/ MySurface surf13;  // ---------------------------  /* auto */
/*43D4*/ uint8_t gap_43D4[16];  // -----------------------  /* auto */
/*43E4*/ char f43E4;  // ---------------------------------  /* auto */
/*43E5*/ uint8_t gap_43E5[15];  // -----------------------  /* auto */
/*43F4*/ int32_t f43F4;  // ------------------------------  /* auto */
/*43F8*/ int32_t f43F8;  // ------------------------------  /* auto */
/*43FC*/ MySurface surf14;  // ---------------------------  /* auto */
/*4424*/ MySurface surf15;  // ---------------------------  /* auto */
/*444C*/ MySurface surf16;  // ---------------------------  /* auto */
/*4474*/ MySurface surf17;  // ---------------------------  /* auto */
/*449C*/ MySurface surf18_x5[5];  // ---------------------  /* auto */
/*4564*/ MySurface surf19_x5[5];  // ---------------------  /* auto */
/*462C*/ MySurface surf20_x5[5];  // ---------------------  /* auto */
/*46F4*/ AABB aabb1_x5[5];  // ---------------------------  /* auto */
/*4744*/ AABB aabb2_x5[5];  // ---------------------------  /* auto */
/*4794*/ AABB aabb3_x5[5];  // ---------------------------  /* auto */
/*47E4*/ MySurface surf21;  // ---------------------------  /* auto */
/*480C*/ MySurface surf22;  // ---------------------------  /* auto */
/*4834*/ MySurface surf23;  // ---------------------------  /* auto */
/*485C*/ MyDdSurface f485C;  // --------------------------  /* auto */
/*4884*/ MySurface surf24;  // ---------------------------  /* auto */
/*48AC*/ MySurface surf25;  // ---------------------------  /* auto */
/*48D4*/ MySurface surf26;  // ---------------------------  /* auto */
/*48FC*/ MySurface surf27;  // ---------------------------  /* auto */
/*4924*/ MySurface surf28_x5[5];  // ---------------------  /* auto */
/*49EC*/ MySurface surf29_x5[5];  // ---------------------  /* auto */
/*4AB4*/ MySurface surf30_x5[5];  // ---------------------  /* auto */
/*4B7C*/ AABB aabb4_x5[5];  // ---------------------------  /* auto */
/*4BCC*/ AABB aabb5_x5[5];  // ---------------------------  /* auto */
/*4C1C*/ AABB aabb6_x5[5];  // ---------------------------  /* auto */
/*4C6C*/ MySurface surf31;  // ---------------------------  /* auto */
/*4C94*/ MyDdSurface f4C94;  // --------------------------  /* auto */
/*4CBC*/ MySurface surf32;  // ---------------------------  /* auto */
/*4CE4*/ MySurface surf33;  // ---------------------------  /* auto */
/*4D0C*/ MySurface surf34_x5[5];  // ---------------------  /* auto */
/*4DD4*/ AABB aabb7_x5[5];  // ---------------------------  /* auto */
/*4E24*/ MySurface surf35;  // ---------------------------  /* auto */
/*4E4C*/ MySurface surf36;  // ---------------------------  /* auto */
/*4E74*/ MySurface surf37;  // ---------------------------  /* auto */
/*4E9C*/ MyDdSurface f4E9C;  // --------------------------  /* auto */
/*4EC4*/ MySurface surf38;  // ---------------------------  /* auto */
/*4EEC*/ MySurface surf39;  // ---------------------------  /* auto */
/*4F14*/ MySurface surf40;  // ---------------------------  /* auto */
/*4F3C*/ MySurface surf41;  // ---------------------------  /* auto */
/*4F64*/ MySurface surf42_x5[5];  // ---------------------  /* auto */
/*502C*/ MySurface surf43_x5[5];  // ---------------------  /* auto */
/*50F4*/ MySurface surf44_x5[5];  // ---------------------  /* auto */
/*51BC*/ AABB aabb8_x5[5];  // ---------------------------  /* auto */
/*520C*/ AABB aabb9_x5[5];  // ---------------------------  /* auto */
/*525C*/ AABB aabb10_x5[5];  // --------------------------  /* auto */
/*52AC*/ MySurface surf45;  // ---------------------------  /* auto */
/*52D4*/ MyDdSurface f52D4;  // --------------------------  /* auto */
/*52FC*/ MySurface surf46;  // ---------------------------  /* auto */
/*5324*/ MySurface surf47;  // ---------------------------  /* auto */
/*534C*/ MySurface surf48_x5[5];  // ---------------------  /* auto */
/*5414*/ AABB aabb11_x5[5];  // --------------------------  /* auto */
/*5464*/ MySurface surf49;  // ---------------------------  /* auto */
/*548C*/ MySurface surf50;  // ---------------------------  /* auto */
/*54B4*/ MySurface surf51_x5[5];  // ---------------------  /* auto */
/*557C*/ AABB aabb12_x5[5];  // --------------------------  /* auto */
/*55CC*/ MySurface surf52;  // ---------------------------  /* auto */
/*55F4*/ MySurface surf53;  // ---------------------------  /* auto */
/*561C*/ MySurface surf54_x5[5];  // ---------------------  /* auto */
/*56E4*/ AABB aabb13_x5[5];  // --------------------------  /* auto */
/*5734*/ MySurface surf55;  // ---------------------------  /* auto */
/*575C*/ MySurface surf56;  // ---------------------------  /* auto */
/*5784*/ MySurface surf57_x5[5];  // ---------------------  /* auto */
/*584C*/ AABB aabb14_x5[5];  // --------------------------  /* auto */
/*589C*/ MyDdSurfaceEx surf_2;  // -----------------------  /* auto */
/*58EC*/ int32_t f58EC;  // ------------------------------  /* auto */
/*58F0*/ MyDdSurfaceEx surf_1;  // -----------------------  /* auto */
/*5940*/ int32_t f5940;  // ------------------------------  /* auto */
/*5944*/ uint32_t f5944;  // -----------------------------  /* auto */
/*5948*/ uint8_t gap_5948[369];  // ----------------------  /* auto */
/*5AB9*/ uint32_t f5AB9;  // -----------------------------  /* auto */
/*5ABD*/ int32_t f5ABD;  // ------------------------------  /* auto */
/*5AC1*/ int32_t f5AC1;  // ------------------------------  /* auto */
/*5AC5*/ int32_t f5AC5;  // ------------------------------  /* auto */
/*5AC9*/ int32_t f5AC9;  // ------------------------------  /* auto */
/*5ACD*/ int32_t f5ACD;  // ------------------------------  /* auto */
/*5AD1*/ uint8_t f5ad1_gap[55];  // ----------------------  /* auto */
/*5B08*/ char f5B08;  // ---------------------------------  /* auto */
/*5B09*/ uint8_t arr_x16x30[16][30];  // -----------------  /* auto */
/*5CE9*/ uint8_t f5CE9;  // ------------------------------  /* auto */
/*5CEA*/ uint8_t gap_5CEA[8];  // ------------------------  /* auto */
/*5CF2*/ CWorldEntry cwolrd_entry_x24[24];  // -----------  /* auto */
/*5F7A*/ uint8_t gap5F7A[122];  // -----------------------  /* auto */
/*5FF4*/ char f5FF4;  // ---------------------------------  /* auto */
/*5FF5*/ char f5FF5;  // ---------------------------------  /* auto */
/*5FF6*/ char f5FF6;  // ---------------------------------  /* auto */
/*5FF7*/ char f5FF7;  // ---------------------------------  /* auto */
/*5FF8*/ char f5FF8;  // ---------------------------------  /* auto */
/*5FF9*/ uint32_t f5FF9;  // -----------------------------  /* auto */
/*5FFD*/ uint32_t f5FFD;  // -----------------------------  /* auto */
/*6001*/ uint32_t f6001;  // -----------------------------  /* auto */
/*6005*/ uint32_t f6005;  // -----------------------------  /* auto */
/*6009*/ uint32_t f6009;  // -----------------------------  /* auto */
/*600D*/ uint32_t f600D;  // -----------------------------  /* auto */
/*6011*/ uint32_t f6011;  // -----------------------------  /* auto */
/*6015*/ uint8_t gap_6015[13];  // -----------------------  /* auto */
/*6022*/ uint32_t key_DIK_SYSRQ;  // ---------------------  /* auto */
/*6026*/ uint8_t gap_6026[22];  // -----------------------  /* auto */
/*603C*/ MySurface surf60_x8[8];  // ---------------------  /* auto */
/*617C*/ MySurface f617C;  // ----------------------------  /* auto */
/*61A4*/ uint8_t gap_61A4[336];  // ----------------------  /* auto */
/*62F4*/ AABB aabb15_x8[8];  // --------------------------  /* auto */
/*6374*/ uint8_t gap_6374[668];  // ----------------------  /* auto */
/*6610*/ uint8_t f6610;  // ------------------------------  /* auto */
/*6611*/ MySurface surf61_x3_applyBtn[3];  // ------------  /* auto */
/*6689*/ MySurface surf62_x3_exitBtn[3];  // -------------  /* auto */
/*6701*/ uint8_t f6701[4];  // ---------------------------  /* auto */
/*6705*/ uint8_t f6705;  // ------------------------------  /* auto */
/*6706*/ uint8_t f6706;  // ------------------------------  /* auto */
/*6707*/ uint8_t f6707;  // ------------------------------  /* auto */
/*6708*/ uint8_t f6708;  // ------------------------------  /* auto */
/*6709*/ uint8_t gap_6709[2];  // ------------------------  /* auto */
/*670B*/ uint8_t f670B;  // ------------------------------  /* auto */
/*670C*/ uint8_t f670C;  // ------------------------------  /* auto */
/*670D*/ uint8_t f670D;  // ------------------------------  /* auto */
/*670E*/ uint8_t gap_670E[19];  // -----------------------  /* auto */
/*6721*/ char f6721;  // ---------------------------------  /* auto */
/*6722*/ uint8_t gap_6722[15];  // -----------------------  /* auto */
/*6731*/ int32_t f6731;  // ------------------------------  /* auto */
/*6735*/ int32_t f6735;  // ------------------------------  /* auto */
/*6739*/ MySurface surf63;  // ---------------------------  /* auto */
/*6761*/ AABB aabb16_x16x30x6[16][30][6];  // ------------  /* auto */
/*11B61*/ MySurface surf64_x16x30x6[16][30][6];  // ------  /* auto */
/*2DD61*/ uint32_t cglow_obj_start;  // ------------------  /* auto */
/*2DD65*/ MySurface surf65_btnRenderOut;  // -------------  /* auto */
/*2DD8D*/ MySurface surf66_x16[16];  // ------------------  /* auto */
/*2E00D*/ AABB aabb17_x16x30[16][30];  // ----------------  /* auto */
/*2FE0D*/ uint8_t gap2FE0D[1292];  // --------------------  /* auto */
/*30319*/ char f30319;  // -------------------------------  /* auto */
/*3031A*/ char f3031A;  // -------------------------------  /* auto */
/*3031B*/ char f3031B;  // -------------------------------  /* auto */
/*3031C*/ char f3031C;  // -------------------------------  /* auto */
/*3031D*/ char f3031D;  // -------------------------------  /* auto */
/*3031E*/ char fontMask;  // -----------------------------  /* auto */
/*3031F*/ char f3031F;  // -------------------------------  /* auto */
/*30320*/ char f30320;  // -------------------------------  /* auto */
/*30321*/ char f30321;  // -------------------------------  /* auto */
/*30322*/ char f30322;  // -------------------------------  /* auto */
/*30323*/ char f30323;  // -------------------------------  /* auto */
/*30324*/ char f30324;  // -------------------------------  /* auto */
/*30325*/ char f30325;  // -------------------------------  /* auto */
/*30326*/ char f30326;  // -------------------------------  /* auto */
/*30327*/ char f30327;  // -------------------------------  /* auto */
/*30328*/ char f30328;  // -------------------------------  /* auto */
/*30329*/ char f30329;  // -------------------------------  /* auto */
/*3032A*/ char f3032A;  // -------------------------------  /* auto */
/*3032B*/ char f3032B;  // -------------------------------  /* auto */
/*3032C*/ char f3032C;  // -------------------------------  /* auto */
/*3032D*/ char f3032D;  // -------------------------------  /* auto */
/*3032E*/ char f3032E;  // -------------------------------  /* auto */
/*3032F*/ char f3032F;  // -------------------------------  /* auto */
/*30330*/ char f30330;  // -------------------------------  /* auto */
/*30331*/ char f30331;  // -------------------------------  /* auto */
/*30332*/ char f30332;  // -------------------------------  /* auto */
/*30333*/ char f30333;  // -------------------------------  /* auto */
/*30334*/ char f30334;  // -------------------------------  /* auto */
/*30335*/ char f30335;  // -------------------------------  /* auto */
/*30336*/ char f30336;  // -------------------------------  /* auto */
/*30337*/ char f30337;  // -------------------------------  /* auto */
/*30338*/ char f30338;  // -------------------------------  /* auto */
/*30339*/ char f30339;  // -------------------------------  /* auto */
/*3033A*/ char f3033A;  // -------------------------------  /* auto */
/*3033B*/ char f3033B;  // -------------------------------  /* auto */
/*3033C*/ int32_t f3033C;  // ----------------------------  /* auto */
/*30340*/ int32_t f30340;  // ----------------------------  /* auto */
/*30344*/ char f30344;  // -------------------------------  /* auto */
/*30345*/ int32_t f30345;  // ----------------------------  /* auto */
/*30349*/ uint8_t gap_30349[1325];  // -------------------  /* auto */
/*30876*/ int32_t f30876;  // ----------------------------  /* auto */
/*3087A*/ uint8_t gap_3087A[876];  // --------------------  /* auto */
/*30BE6*/ MySurface surf67;  // --------------------------  /* auto */
/*30C0E*/ uint8_t f30c0e_gap[4];  // ---------------------  /* auto */
/*30C12*/ int32_t f30C12;  // ----------------------------  /* auto */
/*30C16*/ uint32_t _idx_2b;  // --------------------------  /* auto */
/*30C1A*/ uint32_t f30C1A;  // ---------------------------  /* auto */
/*30C1E*/ uint8_t f30C1E;  // ----------------------------  /* auto */
/*30C1F*/ uint8_t gap_30C1F[4];  // ----------------------  /* auto */
/*30C23*/ int32_t f30C23;  // ----------------------------  /* auto */
/*30C27*/ int32_t f30C27;  // ----------------------------  /* auto */
/*30C2B*/ uint8_t gap_30C2B[236];  // --------------------  /* auto */
/*30D17*/ uint32_t f30D17;  // ---------------------------  /* auto */
/*30D1B*/ uint8_t gap_30D1B[37];  // ---------------------  /* auto */
/*30D40*/ MyDdSurfaceEx surf_30D40;  // ------------------  /* auto */
/*30D90*/ int32_t f30D90;  // ----------------------------  /* auto */
/*30D94*/ MySurface surf68;  // --------------------------  /* auto */
/*30DBC*/ uint8_t gap_30DBC[4];  // ----------------------  /* auto */
/*30DC0*/ MyDdSurfaceEx f30DC0[2];  // -------------------  /* auto */
/*30E60*/ int32_t f30E60[2];  // -------------------------  /* auto */
/*30E68*/ MyDdSurfaceEx f30E68[2];  // -------------------  /* auto */
/*30F08*/ int32_t f30F08[2];  // -------------------------  /* auto */
/*30F10*/ uint8_t f30f10_gap[12];  // --------------------  /* auto */
/*30F1C*/ StaticListeners static_listeners;  // ----------  /* auto */
/*30F30*/ MyCommands commands;  // -----------------------  /* auto */
/*30F44*/ CGuiManager cgui_manager;  // ------------------  /* auto */
/*31128*/ uint8_t gap31128[4];  // -----------------------  /* auto */
/*3112C*/ int32_t obj_start;  // -------------------------  /* auto */
/*31130*/ uint8_t gap_31130[20];  // ---------------------  /* auto */
/*31144*/ char resolutionId;  // -------------------------  /* auto */
/*31145*/ uint8_t gap31145[61];  // ----------------------  /* auto */
/*31182*/ uint32_t f31182;  // ---------------------------  /* auto */
/*31186*/ int32_t f31186;  // ----------------------------  /* auto */
/*3118A*/ int32_t f3118A;  // ----------------------------  /* auto */
/*3118E*/ int32_t f3118E;  // ----------------------------  /* auto */
/*31192*/ int32_t f31192;  // ----------------------------  /* auto */
/*31196*/ int32_t f31196;  // ----------------------------  /* auto */
/*3119A*/ int32_t f3119A;  // ----------------------------  /* auto */
/*3119E*/ int32_t f3119E;  // ----------------------------  /* auto */
/*311A2*/ int32_t f311A2;  // ----------------------------  /* auto */
/*311A6*/ int32_t f311A6;  // ----------------------------  /* auto */
/*311AA*/ int32_t f311AA;  // ----------------------------  /* auto */
/*311AE*/ int32_t f311AE;  // ----------------------------  /* auto */
/*311B2*/ int32_t f311B2;  // ----------------------------  /* auto */
/*311B6*/ int32_t f311B6;  // ----------------------------  /* auto */
/*311BA*/ int32_t f311BA;  // ----------------------------  /* auto */
/*311BE*/ int32_t f311BE;  // ----------------------------  /* auto */
/*311C2*/ int32_t f311C2;  // ----------------------------  /* auto */
/*311C6*/ int32_t f311C6;  // ----------------------------  /* auto */
/*311CA*/ MySurface surf69;  // --------------------------  /* auto */
/*311F2*/ int32_t f311F2;  // ----------------------------  /* auto */
/*311F6*/ int32_t f311F6;  // ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*0066EF3C*/ static void **vftable();  // ----------------  /* auto */
/*---*/ // super CComponent  -----------------------------  /* auto */
/*  0*/ // virtual uint32_t *v_deleting_destructor(char);  // = 0052EF50  /* auto */
/*  4*/ // virtual int32_t v_f4_();  // = 0052EFE0  ------  /* auto */
/*  8*/ // virtual void *v_f8_();  // = 00401200  --------  /* auto */
/*  C*/ // virtual int32_t v_handle();  // = 0052F140  ---  /* auto */
/* 10*/ // virtual uint32_t *v_f10_();  // = 0052F550  ---  /* auto */
/* 14*/ // virtual void ***v_mainGuiLoop();  // = 0052F9E0  /* auto */
/*---*/ // CFrontEndComponent  ---------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*0052E500*/ CFrontEndComponent *constructor();  // ------  /* auto */
/*0052EF50*/ uint32_t *deleting_destructor(char);  // ----  /* auto */
/*0052EF70*/ void destructor();  // ----------------------  /* auto */
/*0052EFE0*/ int32_t fillStaticListeners();  // ----------  /* auto */
/*0052F140*/ int32_t launchGame();  // -------------------  /* auto */
/*0052F550*/ int32_t *fun_52F550();  // ------------------  /* auto */
/*0052F9E0*/ int32_t maybe_update_textures();  // --------  /* auto */
/*0052FF00*/ int32_t draw2dGui();  // --------------------  /* auto */
/*00530180*/ int32_t renderInputField(int32_t *, uint32_t *, int32_t *, CButton *);  /* auto */
/*00532090*/ void fun_532090(uint32_t *);  // ------------  /* auto */
/*00532170*/ CButton *findBtnBySomeId(int32_t, int32_t);    /* auto */
/*005321A0*/ int32_t fun_5321A0(int32_t, int32_t);  // ---  /* auto */
/*005322D0*/ CWindow *getCurrentWindow();  // ------------  /* auto */
/*00533460*/ CWindow *fun_533460(int32_t);  // -----------  /* auto */
/*005334C0*/ int32_t draw2dGui_0();  // ------------------  /* auto */
/*00533570*/ char bakeButton(int32_t, uint8_t, int32_t);    /* auto */
/*00533E90*/ int32_t sub_533E90();  // -------------------  /* auto */
/*005340F0*/ void showTitleScreen();  // -----------------  /* auto */
/*00534210*/ int32_t load();  // -------------------------  /* auto */
/*005352E0*/ void fun_5352E0();  // ----------------------  /* auto */
/*00535950*/ CBridge *sub_535950(CBridge *);  // ---------  /* auto */
/*00535A30*/ NameCfg *sub_535A30();  // ------------------  /* auto */
/*00535C30*/ char fun_535C30(char *);  // ----------------  /* auto */
/*00536370*/ char sub_536370(MyStringTexture *);  // -----  /* auto */
/*00536850*/ int32_t sub_536850();  // -------------------  /* auto */
/*00536BA0*/ CWindow *fun_536BA0(int32_t, int32_t, int32_t, int32_t, int32_t, char, wchar_t *, int32_t, int32_t);  /* auto */
/*00536E20*/ char fun_536E20(int32_t, int32_t);  // ------  /* auto */
/*00537290*/ int32_t fun_537290();  // -------------------  /* auto */
/*00537980*/ char fun_537980();  // ----------------------  /* auto */
/*00539B80*/ uint32_t *fun_539B80(uint32_t *, const char *, int32_t);  /* auto */
/*00539CA0*/ uint32_t *fun_539CA0(uint32_t *, const char *, int32_t);  /* auto */
/*00539E00*/ char saveAddressBookWinsock(char);  // ------  /* auto */
/*0053B980*/ char do_smth_and_showOutro(int32_t);  // ----  /* auto */
/*0053BCD0*/ void showMovie(char *);  // -----------------  /* auto */
/*0053BFD0*/ void showIntro();  // -----------------------  /* auto */
/*0053C020*/ void showBullfrogIntro();  // ---------------  /* auto */
/*0053EF60*/ int32_t fun_53EF60(uint8_t, uint8_t);  // ---  /* auto */
/*0053F7F0*/ int32_t fun_53F7F0(const wchar_t *);  // ----  /* auto */
/*00542570*/ uint32_t sub_542570();  // ------------------  /* auto */
/*00543F30*/ void fun_543F30();  // ----------------------  /* auto */
/*00545E40*/ int32_t fun_545E40();  // -------------------  /* auto */
/*00548610*/ char fun_548610();  // ----------------------  /* auto */
/*00548940*/ char fun_548940(char *);  // ----------------  /* auto */
/*00548DF0*/ int32_t fun_548DF0(int32_t, int32_t);  // ---  /* auto */
/*00548E90*/ void fun_548E90();  // ----------------------  /* auto */
/*00548ED0*/ void fun_548ED0();  // ----------------------  /* auto */
/*00548F10*/ void fun_548F10();  // ----------------------  /* auto */
/*00548F50*/ void fun_548F50();  // ----------------------  /* auto */
/*00548F90*/ void fun_548F90();  // ----------------------  /* auto */
/*00549D10*/ int32_t fun_549D10();  // -------------------  /* auto */
/*0054DB20*/ bool fun_54DB20();  // ----------------------  /* auto */
/*00552C70*/ int32_t fun_552C70();  // -------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(CFrontEndComponent) == 0x311FA);       /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //C_FRONT_END_COMPONENT_H  ------------------------  /* auto */
// -------------------------------------------------------  /* auto */
