// -------------  id: constructor_005052F0  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef C_WORLD_SHORT_ENTRY2_H  // -----------------------  /* auto */
#define C_WORLD_SHORT_ENTRY2_H  // -----------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/utils/Vec3i.h>  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct CWorld;  // -------------------------------------  /* auto */
  struct CWorldShortEntry2;  // --------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct CWorldShortEntry2 {  // ---------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ CWorld *world;  // -------------------------------  /* auto */
/*  4*/ uint16_t f4;  // ---------------------------------  /* auto */
/*  6*/ uint32_t f6;  // ---------------------------------  /* auto */
/*  A*/ int32_t fA;  // ----------------------------------  /* auto */
/*  E*/ int32_t fE;  // ----------------------------------  /* auto */
/* 12*/ Vec3i f12;  // -----------------------------------  /* auto */
/* 1E*/ int32_t f1E;  // ---------------------------------  /* auto */
/* 22*/ int32_t f22;  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*005052F0*/ int32_t constructor();  // ------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(CWorldShortEntry2) == 0x26);  // ----  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //C_WORLD_SHORT_ENTRY2_H  -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
