// -----------------  id: vtbl_0066E3EC  -----------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef C_WORLD_H  // ------------------------------------  /* auto */
#define C_WORLD_H  // ------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/utils/AABB.h>  // --------------------------  /* auto */
#include <dk2/world/CMap.h>  // --------------------------  /* auto */
#include <dk2/world/CResearchOrder.h>  // ----------------  /* auto */
#include <dk2/CWorldEntry.h>  // -------------------------  /* auto */
#include <dk2/CWorldShortEntry2.h>  // -------------------  /* auto */
#include <dk2/GameActionHandler.h>  // -------------------  /* auto */
#include <dk2/world/MyCTremor.h>  // ---------------------  /* auto */
#include <dk2/MyCreatureCollection.h>  // ----------------  /* auto */
#include <dk2/MyDdSurfaceEx.h>  // -----------------------  /* auto */
#include <dk2/MyLevelObjective.h>  // --------------------  /* auto */
#include <dk2/world/MyPlayerMessageQueue.h>  // ----------  /* auto */
#include <dk2/MyRooms.h>  // -----------------------------  /* auto */
#include <dk2/world/MyWorldSacrifice.h>  // --------------  /* auto */
#include <dk2/PlayerList.h>  // --------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct CPlayer;  // ------------------------------------  /* auto */
  struct CTag;  // ---------------------------------------  /* auto */
  struct CWorld;  // -------------------------------------  /* auto */
  struct GameAction;  // ---------------------------------  /* auto */
  struct GameActionCtx;  // ------------------------------  /* auto */
  struct MyCreatureDataObj;  // --------------------------  /* auto */
  struct MyCreatureSpellDataObj;  // ---------------------  /* auto */
  struct MyDoorDataObj;  // ------------------------------  /* auto */
  struct MyKeeperSpellDataObj;  // -----------------------  /* auto */
  struct MyMapElement;  // -------------------------------  /* auto */
  struct MyObjectDataObj;  // ----------------------------  /* auto */
  struct MyProfiler;  // ---------------------------------  /* auto */
  struct MyRoomDataObj;  // ------------------------------  /* auto */
  struct MyShotDataObj;  // ------------------------------  /* auto */
  struct MyTerrainDataObj;  // ---------------------------  /* auto */
  struct MyTrapDataObj;  // ------------------------------  /* auto */
  struct MyTriggerAction;  // ----------------------------  /* auto */
  struct MyTriggerWhen;  // ------------------------------  /* auto */
  struct TbDiscFile;  // ---------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct CWorld {  // --------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  4*/ MyProfiler *profiler;  // ------------------------  /* auto */
/*  8*/ MyCreatureCollection creatures;  // --------------  /* auto */
/* 7A*/ PlayerList playerList;  // -----------------------  /* auto */
/*9BE*/ MyRooms rooms;  // -------------------------------  /* auto */
/*9DA*/ CMap cmap;  // -----------------------------------  /* auto */
/*15A0*/ uint32_t gameSeed;  // --------------------------  /* auto */
/*15A4*/ MyTerrainDataObj *terrainDataObjArr;  // --------  /* auto */
/*15A8*/ int32_t terrainDataObjArr_maxCount;  // ---------  /* auto */
/*15AC*/ int32_t terrainDataObjArr_count;  // ------------  /* auto */
/*15B0*/ int32_t terrainChecksum;  // --------------------  /* auto */
/*15B4*/ MyRoomDataObj *roomDataObjArr;  // --------------  /* auto */
/*15B8*/ int32_t roomDataObjArr_maxCount;  // ------------  /* auto */
/*15BC*/ int32_t roomDataObjArr_count;  // ---------------  /* auto */
/*15C0*/ int32_t roomChecksum;  // -----------------------  /* auto */
/*15C4*/ MyCreatureDataObj *creatureDataObjArr;  // ------  /* auto */
/*15C8*/ int32_t creatureDataObjArr_maxCount;  // --------  /* auto */
/*15CC*/ int32_t creatureDataObjArr_count;  // -----------  /* auto */
/*15D0*/ int32_t creatureChecksum;  // -------------------  /* auto */
/*15D4*/ MyDoorDataObj *doorDataObjArr;  // --------------  /* auto */
/*15D8*/ int32_t doorDataObjArr_maxCount;  // ------------  /* auto */
/*15DC*/ int32_t doorDataObjArr_count;  // ---------------  /* auto */
/*15E0*/ int32_t doorChecksum;  // -----------------------  /* auto */
/*15E4*/ MyTrapDataObj *trapDataObjArr;  // --------------  /* auto */
/*15E8*/ int32_t trapDataObjArr_maxCount;  // ------------  /* auto */
/*15EC*/ int32_t trapDataObjArr_count;  // ---------------  /* auto */
/*15F0*/ int32_t trapChecksum;  // -----------------------  /* auto */
/*15F4*/ MyObjectDataObj *objectDataObjArr;  // ----------  /* auto */
/*15F8*/ int32_t objectDataObjArr_maxCount;  // ----------  /* auto */
/*15FC*/ int32_t objectDataObjArr_count;  // -------------  /* auto */
/*1600*/ int32_t objectChecksum;  // ---------------------  /* auto */
/*1604*/ MyKeeperSpellDataObj *keeperSpellDataObjArr;       /* auto */
/*1608*/ int32_t keeperSpellDataObjArr_maxCount;  // -----  /* auto */
/*160C*/ int32_t keeperSpellDataObjArr_count;  // --------  /* auto */
/*1610*/ int32_t keeperSpellChecksum;  // ----------------  /* auto */
/*1614*/ MyCreatureSpellDataObj *creatureSpellDataObjArr;   /* auto */
/*1618*/ int32_t creatureSpellDataObjArr_maxCount;  // ---  /* auto */
/*161C*/ int32_t creatureSpellDataObjArr_count;  // ------  /* auto */
/*1620*/ int32_t creatureSpellChecksum;  // --------------  /* auto */
/*1624*/ MyShotDataObj *shotDataObjArr;  // --------------  /* auto */
/*1628*/ int32_t shotDataObjArr_maxCount;  // ------------  /* auto */
/*162C*/ int32_t shotDataObjArr_count;  // ---------------  /* auto */
/*1630*/ int32_t shotChecksum;  // -----------------------  /* auto */
/*1634*/ MyDdSurfaceEx surface;  // ----------------------  /* auto */
/*1684*/ GameActionHandler actionHandlers[138];  // ------  /* auto */
/*1F24*/ uint32_t f1F24;  // -----------------------------  /* auto */
/*1F28*/ uint8_t gap_1F28[3884];  // ---------------------  /* auto */
/*2E54*/ MyPlayerMessageQueue playerMessageQueue;  // ----  /* auto */
/*2E70*/ MyWorldSacrifice sacrifices[128];  // -----------  /* auto */
/*3F70*/ uint8_t triggerFlags[128];  // ------------------  /* auto */
/*3FF0*/ int32_t triggerTimers[16];  // ------------------  /* auto */
/*4030*/ uint8_t gap_4030[12480];  // --------------------  /* auto */
/*70F0*/ uint8_t invasionPartyCountArr[24];  // ----------  /* auto */
/*7108*/ uint8_t gap_7108[1];  // ------------------------  /* auto */
/*7109*/ uint8_t creatureOnLevels[256];  // --------------  /* auto */
/*7209*/ uint32_t f7209;  // -----------------------------  /* auto */
/*720D*/ char f720D;  // ---------------------------------  /* auto */
/*720E*/ uint8_t f720e_gap[32];  // ----------------------  /* auto */
/*722E*/ char f722E;  // ---------------------------------  /* auto */
/*722F*/ uint8_t uniqueCreatureTypeId;  // ---------------  /* auto */
/*7230*/ uint8_t clonedCreatureTypeId;  // ---------------  /* auto */
/*7231*/ int32_t uniqueCreatureCreated;  // --------------  /* auto */
/*7235*/ uint8_t gap_7235[4];  // ------------------------  /* auto */
/*7239*/ char flags;  // ---------------------------------  /* auto */
/*723A*/ uint8_t gap_723A;  // ---------------------------  /* auto */
/*723B*/ uint32_t f723B;  // -----------------------------  /* auto */
/*723F*/ uint32_t f723F;  // -----------------------------  /* auto */
/*7243*/ __int16 MEPlayerTagId;  // ----------------------  /* auto */
/*7245*/ AABB aabb_4[4];  // -----------------------------  /* auto */
/*7285*/ int32_t f7285;  // ------------------------------  /* auto */
/*7289*/ int32_t f7289;  // ------------------------------  /* auto */
/*728D*/ int32_t f728D;  // ------------------------------  /* auto */
/*7291*/ char f7291;  // ---------------------------------  /* auto */
/*7292*/ char f7292;  // ---------------------------------  /* auto */
/*7293*/ int32_t f7293;  // ------------------------------  /* auto */
/*7297*/ int32_t f7297;  // ------------------------------  /* auto */
/*729B*/ int32_t timeToPlaceNextGeneratedSpecial;  // ----  /* auto */
/*729F*/ uint8_t currentNoOfGeneratedSpecialsOnLevel;       /* auto */
/*72A0*/ uint8_t hornedReaperTypeId;  // -----------------  /* auto */
/*72A1*/ char f72A1;  // ---------------------------------  /* auto */
/*72A2*/ int32_t levelScore;  // -------------------------  /* auto */
/*72A6*/ int32_t levelScoreSet;  // ----------------------  /* auto */
/*72AA*/ int32_t levelTimeLimit;  // ---------------------  /* auto */
/*72AE*/ int32_t numberOfNonUniqueCreatureDescriptors;      /* auto */
/*72B2*/ int32_t bContinualHeroInvasion;  // -------------  /* auto */
/*72B6*/ uint16_t specialInfoPlayerId;  // ---------------  /* auto */
/*72B8*/ int32_t specialInfoMaximumSlaps;  // ------------  /* auto */
/*72BC*/ uint8_t specialInfoNextRoomTypeId;  // ----------  /* auto */
/*72BD*/ MyLevelObjective LevelObjectives[6];  // --------  /* auto */
/*72E7*/ int32_t levelChecksum;  // ----------------------  /* auto */
/*72EB*/ uint8_t loadingLevelId;  // ---------------------  /* auto */
/*72EC*/ CResearchOrder recearchOrder;  // ---------------  /* auto */
/*7304*/ uint8_t gap_7304[4];  // ------------------------  /* auto */
/*7308*/ MyTriggerWhen *triggerWhens;  // ----------------  /* auto */
/*730C*/ MyTriggerAction *triggerActions;  // ------------  /* auto */
/*7310*/ __int16 triggerRoot;  // ------------------------  /* auto */
/*7312*/ uint16_t numberOfTriggerWhens;  // --------------  /* auto */
/*7314*/ uint16_t numberOfUsedTriggerWhens;  // ----------  /* auto */
/*7316*/ uint16_t numberOfTriggerActions;  // ------------  /* auto */
/*7318*/ uint16_t numberOfUsedTriggerActions;  // --------  /* auto */
/*731A*/ uint8_t triggerRootRepeatCount;  // -------------  /* auto */
/*731B*/ uint8_t numberOfSacrificeCombinations;  // ------  /* auto */
/*731C*/ int32_t potentialManaGain;  // ------------------  /* auto */
/*7320*/ int32_t potentialMaxMana;  // -------------------  /* auto */
/*7324*/ uint8_t gap_7324[10304];  // --------------------  /* auto */
/*9B64*/ int32_t levelTextId[7];  // ---------------------  /* auto */
/*9B80*/ uint8_t previousRewardId[5];  // ----------------  /* auto */
/*9B85*/ uint8_t f9b85_gap[1];  // -----------------------  /* auto */
/*9B86*/ uint8_t currentRewardId[5];  // -----------------  /* auto */
/*9B8B*/ uint8_t f9b8b_gap[1];  // -----------------------  /* auto */
/*9B8C*/ uint8_t f9B8B_levelIntroOverride_f2[8];  // -----  /* auto */
/*9B94*/ uint16_t LevelIntroOverride_f1[8];  // ----------  /* auto */
/*9BA4*/ uint8_t f9ba4_gap[10];  // ----------------------  /* auto */
/*9BAE*/ uint8_t waterTerrainTypeId;  // -----------------  /* auto */
/*9BAF*/ uint8_t lavaTerrainTypeId;  // ------------------  /* auto */
/*9BB0*/ MyCTremor tremors[8];  // -----------------------  /* auto */
/*9C50*/ CWorldShortEntry2 short2_entries_8[8];  // ------  /* auto */
/*9D80*/ uint8_t gap9D80[68];  // ------------------------  /* auto */
/*9DC4*/ CWorldEntry entries_6[6];  // -------------------  /* auto */
/*9E66*/ int32_t f9E66;  // ------------------------------  /* auto */
/*9E6A*/ int32_t f9E6A;  // ------------------------------  /* auto */
/*9E6E*/ int32_t DungeonCentre_DECAY_meshIdx[2];  // -----  /* auto */
/*9E76*/ CWorldEntry entries_2[2];  // -------------------  /* auto */
/*9EAC*/ uint8_t gap9EAC[120];  // -----------------------  /* auto */
/*9F24*/ CWorldEntry entries_30[30];  // -----------------  /* auto */
/*A24E*/ uint8_t gapA24E[28];  // ------------------------  /* auto */
/*A26A*/ CWorldEntry entries_7[7];  // -------------------  /* auto */
/*A327*/ uint8_t fa327_gap[60];  // ----------------------  /* auto */
/*A363*/ int32_t RedTexture_texIdx;  // ------------------  /* auto */
/*A367*/ int32_t BlueTexture_texIdx;  // -----------------  /* auto */
/*A36B*/ int32_t RedTexture_texIdx_A36B;  // -------------  /* auto */
/*A36F*/ int32_t BlueTexture_texIdx_A36F;  // ------------  /* auto */
/*A373*/ int32_t RedTexture_texIdx_A373;  // -------------  /* auto */
/*A377*/ int32_t BlueTexture_texIdx_A377;  // ------------  /* auto */
/*A37B*/ int32_t ObjectiveTexture_texIdx;  // ------------  /* auto */
/*A37F*/ int32_t CharredTexture_texIdx;  // --------------  /* auto */
/*A383*/ int32_t CreatureLightning_texIdx;  // -----------  /* auto */
/*A387*/ int32_t CreatureFreeze_texIdx;  // --------------  /* auto */
/*A38B*/ int32_t CreatureInvulnerable_texIdx;  // --------  /* auto */
/*A38F*/ int32_t CreatureSlow_texIdx;  // ----------------  /* auto */
/*A393*/ int32_t CreatureInvisible_texIdx;  // -----------  /* auto */
/*A397*/ int32_t CreaturePoison_texIdx;  // --------------  /* auto */
/*A39B*/ int32_t fun;  // --------------------------------  /* auto */
/*A39F*/ int32_t funArg;  // -----------------------------  /* auto */
/*A3A3*/ int32_t buf_field_A3A3;  // ---------------------  /* auto */
/*A3A7*/ int32_t buf_field_A3A7;  // ---------------------  /* auto */
/*A3AB*/ int32_t fA3AB;  // ------------------------------  /* auto */
/*A3AF*/ int32_t fA3AF;  // ------------------------------  /* auto */
/*A3B3*/ int32_t initialSpecialsOnLevelCount;  // --------  /* auto */
/*A3B7*/ int32_t fA3B7;  // ------------------------------  /* auto */
/*A3BB*/ int32_t fA3BB;  // ------------------------------  /* auto */
/*A3BF*/ int32_t is_surface_filled;  // ------------------  /* auto */
/*A3C3*/ int32_t fA3C3;  // ------------------------------  /* auto */
/*A3C7*/ int32_t fA3C7;  // ------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*0066E3EC*/ static void **vftable();  // ----------------  /* auto */
/*---*/ // CWorld  ---------------------------------------  /* auto */
/*  0*/ virtual void *v_sub_5098E0(char);  // = 005098E0    /* auto */
/*  4*/ virtual int32_t v_f4_create_objects();  // = 005099A0  /* auto */
/*  8*/ virtual char v_fun_50A2F0();  // = 0050A2F0  -----  /* auto */
/*  C*/ virtual uint16_t v_fun_510E90(GameAction *, int32_t);  // = 00510E90  /* auto */
/* 10*/ virtual PlayerList *v_getPlayerList();  // = 00508C00  /* auto */
/* 14*/ virtual BOOL v_loc_508C10(int32_t);  // = 00508C10  /* auto */
/* 18*/ virtual uint32_t v_tick(GameActionCtx *);  // = 0050A450  /* auto */
/* 1C*/ virtual int32_t v_loadLevel(const char *);  // = 0050E620  /* auto */
/* 20*/ virtual int32_t v_fun_50FBA0();  // = 0050FBA0  --  /* auto */
