// -------------  id: constructor_00597400  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef FLOAT_OBJ_THING_H  // ----------------------------  /* auto */
#define FLOAT_OBJ_THING_H  // ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct FloatObjThing;  // ------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct FloatObjThing {  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ uint16_t f0;  // ---------------------------------  /* auto */
/*  2*/ int32_t lastTimeMs;  // --------------------------  /* auto */
/*  6*/ float f6;  // ------------------------------------  /* auto */
/*  A*/ int32_t fA;  // ----------------------------------  /* auto */
/*  E*/ uint32_t fE;  // ---------------------------------  /* auto */
/* 12*/ uint16_t word_buf_3x256_cpy1[3][256];  // --------  /* auto */
/*612*/ uint16_t word_buf_3x256_cpy2[3][256];  // --------  /* auto */
/*C12*/ uint16_t word_buf_3x256[3][256];  // -------------  /* auto */
/*1212*/ int32_t count;  // ------------------------------  /* auto */
/*1216*/ int32_t count_limit;  // ------------------------  /* auto */
/*121A*/ __int16 f121A[24];  // --------------------------  /* auto */
/*124A*/ int32_t timeMs;  // -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*00597400*/ int32_t constructor();  // ------------------  /* auto */
/*00597450*/ uint16_t *init_retBuf3x256();  // -----------  /* auto */
/*00597690*/ int32_t fun_597690(__int16, int32_t);  // ---  /* auto */
/*005976D0*/ int32_t init5(int32_t, int32_t, int32_t);      /* auto */
/*00597760*/ int32_t switch_float_math(uint16_t);  // ----  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(FloatObjThing) == 0x124E);  // ------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //FLOAT_OBJ_THING_H  ------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
