// ---------------  id: instance_0073EDC8  ---------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MOVIE_RENDERER_H  // -----------------------------  /* auto */
#define MOVIE_RENDERER_H  // -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct MovieCtx;  // -----------------------------------  /* auto */
  struct MovieRenderer;  // ------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MovieRenderer {  // -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ MovieCtx *ctx;  // -------------------------------  /* auto */
/*  4*/ int32_t flags;  // -------------------------------  /* auto */
/*  8*/ int32_t f8;  // ----------------------------------  /* auto */
/*  C*/ IDirectDraw *lpdd;  // ---------------------------  /* auto */
/* 10*/ IDirectDraw2 *dd2;  // ---------------------------  /* auto */
/* 14*/ IDirectDrawSurface2 *p_primarySurf;  // ----------  /* auto */
/* 18*/ IDirectDrawSurface2 *p_offScreenSurf;  // --------  /* auto */
/* 1C*/ IDirectDrawSurface2 *surf;  // -------------------  /* auto */
/* 20*/ IDirectDrawSurface2 *offScrSurf;  // -------------  /* auto */
/* 24*/ IDirectDrawPalette *ddPalette;  // ---------------  /* auto */
/* 28*/ tagPALETTEENTRY *pPaletteEntry;  // --------------  /* auto */
/* 2C*/ uint32_t f2C;  // --------------------------------  /* auto */
/* 30*/ uint32_t f30;  // --------------------------------  /* auto */
/* 34*/ uint32_t f34;  // --------------------------------  /* auto */
/* 38*/ uint32_t f38;  // --------------------------------  /* auto */
/* 3C*/ uint32_t f3C;  // --------------------------------  /* auto */
/* 40*/ uint32_t f40;  // --------------------------------  /* auto */
/* 44*/ int32_t f44;  // ---------------------------------  /* auto */
/* 48*/ uint32_t f48;  // --------------------------------  /* auto */
/* 4C*/ uint32_t f4C;  // --------------------------------  /* auto */
/* 50*/ uint32_t f50;  // --------------------------------  /* auto */
/* 54*/ IDirectSound *directSound;  // -------------------  /* auto */
/* 58*/ int32_t obj_58;  // ------------------------------  /* auto */
/* 5C*/ IDirectSoundBuffer *soundBuffer;  // -------------  /* auto */
/* 60*/ int32_t height;  // ------------------------------  /* auto */
/* 64*/ uint32_t width;  // ------------------------------  /* auto */
/* 68*/ uint32_t f68;  // --------------------------------  /* auto */
/* 6C*/ uint32_t f6C;  // --------------------------------  /* auto */
/* 70*/ uint32_t f70;  // --------------------------------  /* auto */
/* 74*/ uint32_t f74;  // --------------------------------  /* auto */
/* 78*/ uint32_t f78;  // --------------------------------  /* auto */
/* 7C*/ uint32_t f7C;  // --------------------------------  /* auto */
/* 80*/ int32_t f80;  // ---------------------------------  /* auto */
/* 84*/ uint32_t f84;  // --------------------------------  /* auto */
/* 88*/ uint32_t f88;  // --------------------------------  /* auto */
/* 8C*/ uint32_t soundVolume;  // ------------------------  /* auto */
/* 90*/ int32_t f90;  // ---------------------------------  /* auto */
/* 94*/ uint32_t f94;  // --------------------------------  /* auto */
/* 98*/ uint32_t f98;  // --------------------------------  /* auto */
/* 9C*/ uint32_t atomicLong;  // -------------------------  /* auto */
/* A0*/ HWND__ *hwnd;  // --------------------------------  /* auto */
/* A4*/ HMMIO__ *hMmio;  // ------------------------------  /* auto */
/* A8*/ int32_t fA8;  // ---------------------------------  /* auto */
/* AC*/ uint32_t fAC;  // --------------------------------  /* auto */
/* B0*/ int32_t pFun;  // --------------------------------  /* auto */
/* B4*/ uint8_t lbuf_0x700[1792];  // --------------------  /* auto */
/*7B4*/ int32_t end_counter;  // -------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*005A8B20*/ int32_t sub_5A8B20();  // -------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MovieRenderer) == 0x7B8);  // -------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MOVIE_RENDERER_H  -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
