// ---------------  id: call_new_00555576  ---------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_CMD_HANDLER_H  // -----------------------------  /* auto */
#define MY_CMD_HANDLER_H  // -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct CEntryComponent;  // ----------------------------  /* auto */
  struct MyCmdHandler;  // -------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyCmdHandler {  // --------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ char *str;  // -----------------------------------  /* auto */
/*  4*/ int32_t count;  // -------------------------------  /* auto */
/*  8*/ uint32_t *parr;  // ------------------------------  /* auto */
/*  C*/ void *handler;  // -------------------------------  /* auto */
/* 10*/ void *handler2;  // ------------------------------  /* auto */
/* 14*/ CEntryComponent *owner;  // ----------------------  /* auto */
/* 18*/ int32_t f18;  // ---------------------------------  /* auto */
/* 1C*/ MyCmdHandler *prev;  // --------------------------  /* auto */
/* 20*/ MyCmdHandler *next;  // --------------------------  /* auto */
/* 24*/ uint32_t arr;  // --------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyCmdHandler) == 0x28);  // ---------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_CMD_HANDLER_H  -------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
