// -------------  id: constructor_0055EC20  --------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef MY_KEYBOARD_H  // --------------------------------  /* auto */
#define MY_KEYBOARD_H  // --------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
#include <dk2/DxKeyEntry.h>  // --------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct KeyEntry;  // -----------------------------------  /* auto */
  struct MyKeyboard;  // ---------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct MyKeyboard {  // ----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ uint32_t f0;  // ---------------------------------  /* auto */
/*  4*/ uint32_t f4;  // ---------------------------------  /* auto */
/*  8*/ int32_t f8;  // ----------------------------------  /* auto */
/*  C*/ uint8_t fc_gap[4];  // ---------------------------  /* auto */
/* 10*/ uint32_t f10;  // --------------------------------  /* auto */
/* 14*/ uint8_t gap_14[60];  // --------------------------  /* auto */
/* 50*/ uint8_t f50;  // ---------------------------------  /* auto */
/* 51*/ uint8_t f51;  // ---------------------------------  /* auto */
/* 52*/ uint8_t gap_52[63];  // --------------------------  /* auto */
/* 91*/ uint8_t f91;  // ---------------------------------  /* auto */
/* 92*/ uint8_t gap_92[63];  // --------------------------  /* auto */
/* D1*/ uint8_t fD1;  // ---------------------------------  /* auto */
/* D2*/ uint8_t fd2_gap[31];  // -------------------------  /* auto */
/* F1*/ int32_t is__;  // --------------------------------  /* auto */
/* F5*/ int32_t fF5;  // ---------------------------------  /* auto */
/* F9*/ int32_t fF9;  // ---------------------------------  /* auto */
/* FD*/ uint8_t ffd_gap[8];  // --------------------------  /* auto */
/*105*/ int32_t f105;  // --------------------------------  /* auto */
/*109*/ __int16 f109;  // --------------------------------  /* auto */
/*10B*/ char layoutName[24];  // -------------------------  /* auto */
/*123*/ uint8_t f123;  // --------------------------------  /* auto */
/*124*/ uint8_t gap_124[151];  // ------------------------  /* auto */
/*1BB*/ int32_t f1BB;  // --------------------------------  /* auto */
/*1BF*/ int32_t count;  // -------------------------------  /* auto */
/*1C3*/ int32_t levelAttempts[40];  // -------------------  /* auto */
/*263*/ DxKeyEntry actionToDxKey[64];  // ----------------  /* auto */
/*463*/ uint32_t idxToKey_map[256];  // ------------------  /* auto */
/*863*/ uint8_t gap_863[190];  // ------------------------  /* auto */
/*921*/ uint8_t f921[476];  // ---------------------------  /* auto */
/*AFD*/ int32_t fAFD[7];  // -----------------------------  /* auto */
/*B19*/ uint8_t fB19;  // --------------------------------  /* auto */
/*B1A*/ uint8_t gap_B1A[27];  // -------------------------  /* auto */
/*B35*/ uint32_t fB35;  // -------------------------------  /* auto */
/*B39*/ uint32_t fB39;  // -------------------------------  /* auto */
/*B3D*/ char fB3D[127];  // ------------------------------  /* auto */
/*BBC*/ char end;  // ------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*0055EC20*/ MyKeyboard *constructor();  // --------------  /* auto */
/*0055ED10*/ void destructor();  // ----------------------  /* auto */
/*0055EE50*/ HKEY__ *sub_55EE50();  // -------------------  /* auto */
/*0055F040*/ HKEY__ *sub_55F040();  // -------------------  /* auto */
/*0055F6D0*/ HKEY__ *sub_55F6D0(HKEY__ **);  // ----------  /* auto */
/*005604C0*/ KeyEntry *fillKeyMaps();  // ----------------  /* auto */
/*005609C0*/ char *getLayoutName();  // ------------------  /* auto */
/*00560D60*/ HKEY__ *sub_560D60_playerLevelStatus(HKEY__ *, int32_t);  /* auto */
/*00560E30*/ HKEY__ *sub_560E30_levelNumber(HKEY__ *);      /* auto */
/*00560EC0*/ HKEY__ *sub_560EC0_mpdLevelNumber(HKEY__ *);   /* auto */
/*00560F50*/ HKEY__ *saveKeyTable();  // -----------------  /* auto */
/*00561200*/ int32_t sub_561200(int32_t, int32_t, int32_t, uint32_t);  /* auto */
/*005614B0*/ HKEY__ *sub_5614B0_secretLevels();  // ------  /* auto */
/*00561540*/ HKEY__ *sub_561540_secretLevelsCompleted();    /* auto */
/*00561920*/ int32_t fun_561920();  // -------------------  /* auto */
/*00561A20*/ HKEY__ *sub_561A20_levelAttempts(uint32_t);    /* auto */
/*00561BF0*/ HKEY__ *sub_561BF0_totalEvilRating(uint32_t, int32_t);  /* auto */
/*00561DC0*/ uint32_t fun_561DC0();  // ------------------  /* auto */
/*00561E40*/ uint8_t *sub_561E40(uint32_t);  // ----------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(MyKeyboard) == 0xBBD);  // ----------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //MY_KEYBOARD_H  ----------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
