// ---------------  id: call_new_00571B3B  ---------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef NEW_OBJ571_B3_B_H  // ----------------------------  /* auto */
#define NEW_OBJ571_B3_B_H  // ----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct NewObj571B3B;  // -------------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct NewObj571B3B {  // --------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ __int16 a2;  // ----------------------------------  /* auto */
/*  2*/ __int16 a3;  // ----------------------------------  /* auto */
/*  4*/ int32_t f4;  // ----------------------------------  /* auto */
/*  8*/ int32_t f8;  // ----------------------------------  /* auto */
/*  C*/ int32_t fC;  // ----------------------------------  /* auto */
/* 10*/ int32_t f10;  // ---------------------------------  /* auto */
/* 14*/ NewObj571B3B *prev;  // --------------------------  /* auto */
/* 18*/ int32_t flags;  // -------------------------------  /* auto */
/* 1C*/ NewObj571B3B *nextprev;  // ----------------------  /* auto */
/* 20*/ NewObj571B3B *next;  // --------------------------  /* auto */
/* 24*/ NewObj571B3B *np;  // ----------------------------  /* auto */
/* 28*/ int32_t f28;  // ---------------------------------  /* auto */
/* 2C*/ int32_t f2C;  // ---------------------------------  /* auto */
/* 30*/ int32_t f30;  // ---------------------------------  /* auto */
/* 34*/ int32_t f34;  // ---------------------------------  /* auto */
/* 38*/ int32_t f38;  // ---------------------------------  /* auto */
/* 3C*/ int32_t f3C;  // ---------------------------------  /* auto */
/* 40*/ int32_t f40;  // ---------------------------------  /* auto */
/* 44*/ uint8_t gap_44[128];  // -------------------------  /* auto */
/* C4*/ int32_t fC4;  // ---------------------------------  /* auto */
/* C8*/ int32_t fC8;  // ---------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(NewObj571B3B) == 0xCC);  // ---------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //NEW_OBJ571_B3_B_H  ------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
