// ---------------  id: instance_007428A0  ---------------  /* auto */
// ----  warning: file is managed by gen_struct_h.py  ----  /* auto */
// ---  you can edit code only in *_user_code blocks  ----  /* auto */
// -------------------------------------------------------  /* auto */
#ifndef PROBABLY_CONSOLE_H  // ---------------------------  /* auto */
#define PROBABLY_CONSOLE_H  // ---------------------------  /* auto */
// -------------------------------------------------------  /* auto */
#include <cstdint>  // -----------------------------------  /* auto */
#include <cstdio>  // ------------------------------------  /* auto */
#include <dinput.h>  // ----------------------------------  /* auto */
#include <dsound.h>  // ----------------------------------  /* auto */
#include <ddraw.h>  // -----------------------------------  /* auto */
#include <d3d.h>  // -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
  struct CComponent;  // ---------------------------------  /* auto */
  struct MyCommands;  // ---------------------------------  /* auto */
  struct ProbablyConsole;  // ----------------------------  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: head_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
namespace dk2 {  // --------------------------------------  /* auto */
#pragma pack(push, 1)  // --------------------------------  /* auto */
struct ProbablyConsole {  // -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*  0*/ MyCommands *commands;  // ------------------------  /* auto */
/*  4*/ char input[64][128];  // -------------------------  /* auto */
/*2004*/ uint32_t inputIdx;  // --------------------------  /* auto */
/*2008*/ uint32_t f2008;  // -----------------------------  /* auto */
/*200C*/ uint32_t inputcount;  // ------------------------  /* auto */
/*2010*/ int32_t f2010;  // ------------------------------  /* auto */
/*2014*/ char output[64][128];  // -----------------------  /* auto */
/*4014*/ uint32_t outputIdx;  // -------------------------  /* auto */
/*4018*/ uint32_t outputCount;  // -----------------------  /* auto */
// -------------------------------------------------------  /* auto */
/*005543F0*/ MyCommands *setCommands(MyCommands *);  // --  /* auto */
/*00554410*/ int32_t appendOutput(char *);  // -----------  /* auto */
/*00554650*/ int32_t kbAction(int32_t, CComponent *);       /* auto */
/*00554910*/ uint32_t onKeyPressed(int32_t, CComponent *);  /* auto */
// -------------------------------------------------------  /* auto */
// ---------------  block: body_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
};  // ---------------------------------------------------  /* auto */
#pragma pack(pop)  // ------------------------------------  /* auto */
static_assert(sizeof(ProbablyConsole) == 0x401C);  // ----  /* auto */
}  // namespace dk2  -------------------------------------  /* auto */
// ---------------  block: tail_user_code  ---------------  /* auto */

// user code

// ---------------  end_of_block  ------------------------  /* auto */
#endif //PROBABLY_CONSOLE_H  -----------------------------  /* auto */
// -------------------------------------------------------  /* auto */
